[
  {
    "id": 1,
    "title": "When is the 2025 Macy’s Thanksgiving Day Parade? Performers, how to watch, more",
    "url": "https://www.msn.com/en-us/tv/news/when-is-the-2025-macy-s-thanksgiving-day-parade-performers-how-to-watch-more/ar-AA1QArjd?ocid=BingNewsVerp",
    "publisher": "msn.com",
    "date": "2025-11-18",
    "snippet": "The 99th edition of Macys Thanksgiving Day Parade will begin on Manhattan’s Upper West Side and end at Macy’s flagship store ...",
    "content": "MSN",
    "credibility": 0.6
  },
  {
    "id": 2,
    "title": "Black Friday 2025 live: Latest deals from shopping experts",
    "url": "https://www.msn.com/en-us/news/technology/black-friday-2025-live-latest-deals-from-shopping-experts/ar-AA1PI6JC?ocid=BingNewsVerp",
    "publisher": "msn.com",
    "date": "2025-11-18",
    "snippet": "Black Friday 2025 lands on 28 November, but we’re already seeing the best deals from major retailers like Boots, Amazon and ...",
    "content": "MSN",
    "credibility": 0.6
  },
  {
    "id": 3,
    "title": "I visited gorgeous UK town packed with shops but not a single chain — I'd move here tomorrow",
    "url": "https://www.mirror.co.uk/travel/uk-ireland/travel-narberth-town-pembrokeshire-wales-36247355",
    "publisher": "mirror.co.uk",
    "date": "2025-11-18",
    "snippet": "Narberth in Pembrokeshire is home to some of Wales' best independent stores - and they can all be found on one high street.",
    "content": "I visited gorgeous UK town packed with shops but not a single chain — I'd move here tomorrow - The Mirror ‌ ‌ Skip to main content News Celebs Football Lifestyle More InYourArea Funeral Notices Shop Competitions Dating Offers Newsletter Signup Follow us on social Daily Mirror Icon Travel UK & Ireland Tourism I visited gorgeous UK town packed with shops but not a single chain — I'd move here tomorrow Narberth in Pembrokeshire is home to some of Wales' best independent stores - and they can all be found on one high street. Travel opinion Steffan Rhys Deputy Content Hub Director 04:55, 17 Nov 2025 View 14 Images This town is full of independent gems and is a pleasure to walk around (Image: Steffan Rhys) This special little town and its charms are both well-known enough for it to thrive but still well enough off the beaten path to feel like a hidden gem that's not overwhelmed with tourism. ‌ Not on a main road and often overlooked in favour of nearby seaside resorts, this Pembrokeshire town is packed with independent shops and boutiques, cosy pubs and outstanding restaurants. And there are no chain shops or empty lots to be seen. ‌ While heading west for a short break, I called in to eat at a place called Hwb for the first time and found so much more, including some of Wales' finest restaurants to pubs, local butchers, antique shops, clothing boutiques, bridal stores and hair salons. ‌ In addition to these, there's the \"Quirky Garage,\" which sells an array of knick-knacks, with a particular focus on oversized animal models; there's an arts centre; a community-run library situated in a quaint old school; a social club where pints are a steal at £3.10; another arts centre; and \"The Shop at No47\", self-described as \"quite possibly Pembrokeshire's most perfectly pleasant place to peruse\". View 14 Images Narberth is a 'lifestyle' as much as a place to live (Image: Crown Copyright Visit Wales 2025) View 14 Images A sign on a lamppost advertised a \"hymns and Pimms\" night at a local church (Image: Steffan Rhys) ‌ On the high street, I saw a sign on a lamppost announcing an upcoming \"hymns and Pimms\" night at the local church. The former town hall of Narberth, crowned with a clock tower and a petite steeple, stands solitary on a traffic island at one end of the high street, with stone steps leading up to its entrance. Today, it houses The Golden Sheaf, a shop selling chic clothes, books, home furnishings and jewellery, but the building itself harks back to the 1830s. It was built on the site of an old tap where townsfolk would gather for their water supply. Its original clock, until very recently, was wound weekly by a town council member, following the same meticulous instructions from over a century ago. ‌ The area, however, is not all quaint and quirky boutiques. Just beyond the town centre lies the opulent Grove, a breathtakingly exclusive hotel and restaurant offering food, rooms and surroundings that rival anything Wales has to offer. View 14 Images The stunning Grove at Narberth hotel and restaurant on the outskirts of town (Image: Crown Copyright Visit Wales 2025) It's a bit pricey, with rooms starting at around £250 a night, suites exceeding £500, and a seven-course tasting menu in its flagship restaurant setting you back £145 per person. Even amongst all of Wales' most picturesque and intriguing towns, Narberth holds its own. ‌ Locals describe it as \"an effervescent little place with a robust sense of community\" and say those who reside here \"live for the lifestyle\". This becomes immediately apparent upon reaching the bustling high street at its core, which teems with people perusing shop windows and popping in and out of stores even during a Tuesday lunchtime. The sheer amount of activity in the town centre contradicts its modest 3,000 population. Calling it a hidden gem might be stretching things within Wales, where it frequently earns recognition as the finest place to reside, yet it remains relatively unknown throughout the U",
    "credibility": 0.6
  },
  {
    "id": 4,
    "title": "Foreign enrollment at US colleges holds steady, for now, despite Trump's visa crackdown",
    "url": "https://www.msn.com/en-us/news/us/foreign-enrollment-at-us-colleges-holds-steady-for-now-despite-trumps-visa-crackdown/ar-AA1Qz1a8?ocid=BingNewsVerp",
    "publisher": "msn.com",
    "date": "2025-11-18",
    "snippet": "A new report finds that foreign students enrolled at U.S. colleges in strong numbers this fall despite fears that a Trump ...",
    "content": "MSN",
    "credibility": 0.6
  },
  {
    "id": 5,
    "title": "The Gigantic Outlet Mall In Iowa That’ll Make You Rethink What $45 Can Buy",
    "url": "https://familydestinationsguide.com/gigantic-outlet-mall-iowa/",
    "publisher": "familydestinationsguide.com",
    "date": "2025-11-18",
    "snippet": "Your credit card might need a brief recovery period, but your wardrobe will thank you, your gift recipients will be impressed, and you’ll have tangible proof that in Iowa, $45 can indeed work retail ...",
    "content": "The Gigantic Outlet Mall In Iowa That’ll Make You Rethink What $45 Can Buy Skip to Content Search Magnifying Glass Search for: Close Search × Choose Your State Hidden Gems Family Travel Beaches and Islands Activities Travel on a Budget Food & Drink Water Parks Seasonal Travel Wildlife and Nature Weird and Amazing Arts and Culture Restaurants About The Gigantic Outlet Mall In Iowa That’ll Make You Rethink What $45 Can Buy By: Author Dylan Nelson Posted on November 17, 2025 0 Comments Categories Destinations , Iowa , News , USA In the heart of Iowa’s rolling landscape sits a shopper’s paradise where your hard-earned dollars stretch like carnival taffy and designer labels don’t require a second mortgage. The Outlets Williamsburg isn’t just a collection of stores – it’s a retail wonderland where $45 can transform from “barely enough for one full-price t-shirt” to “how did I just get three bags of clothes?” The grand entrance of Outlets Williamsburg rises like a modern monument to shopping, inviting visitors to uncover the treasures waiting inside. Photo credit: Ryan Bradley This sprawling shopping mecca stands as proof that Iowans don’t need to trek to Chicago or Minneapolis for retail therapy that won’t require a payment plan. The first thing you’ll notice approaching Outlets Williamsburg is its impressive scale – a clean-lined, modern retail village rising from the Iowa countryside like a mirage for the fashion-starved. The architectural design strikes that perfect balance between functional and attractive, with covered walkways connecting clusters of stores in an intuitive layout that doesn’t require breadcrumbs to find your way back to your starting point. Unlike those labyrinthine indoor malls where you lose all concept of time and begin to question if the outside world still exists, the open-air design here keeps you connected to Iowa’s big sky while you contemplate if those jeans make your legs look longer (they do, by the way). Color-coded fashion paradise where shirts are stacked with military precision. Your wallet’s worst nightmare, your closet’s dream come true. Photo credit: Greg Johnson The strategic location just off Interstate 80 near the historic Amana Colonies is no happy accident. Positioned within reasonable driving distance from Cedar Rapids, Iowa City, and even Des Moines, it’s far enough from major metropolitan areas to feel like a destination but accessible enough for an impromptu day trip when retail therapy becomes less optional and more medicinal. The store directory reads like a fashion magazine’s advertiser list, featuring retail royalty that might surprise visitors who assumed Iowa was all cornfields and casual wear. Nike’s expansive outlet store serves as a mecca for athletic enthusiasts and anyone who appreciates the marriage of function and style. The space feels almost gallery-like, with shoes displayed as if they’re art installations (which, let’s be honest, some of them are). The shopping equivalent of yellow brick road, complete with signage that reads like a fashionista’s wish list. Photo credit: Nhat Truong Rows of performance gear, running shoes, and basketball sneakers await at prices that might make you double-check the tag to ensure there hasn’t been some fortuitous pricing error. The layout encourages browsing without the elbow-to-elbow combat that characterizes many retail experiences, giving you space to contemplate whether those running shorts will actually motivate you to run or just look good while you contemplate running. For those harboring a weakness for luxury accessories (a condition affecting approximately 99% of shoppers), the Coach outlet presents a particularly delicious temptation. The store’s elegant displays showcase leather goods that somehow manage to be both timeless and trendy, with price tags that transform “someday” purchases into “today” possibilities. The staff here has mastered the art of being available without hovering – appearing magically when you have a que",
    "credibility": 0.6
  },
  {
    "id": 6,
    "title": "Take a look at the new Ripley’s Believe It or Not! Christmas Park in Hialeah",
    "url": "https://www.msn.com/en-us/travel/tripideas/take-a-look-at-the-new-ripleys-believe-it-or-not-christmas-park-in-hialeah/ar-AA1QBE3p?ocid=BingNewsVerp",
    "publisher": "msn.com",
    "date": "2025-11-18",
    "snippet": "Experience Ripley’s Believe It or Not! Christmas Park in Hialeah with quirky exhibits, seasonal attractions, and family-friendly holiday displays this season.",
    "content": "MSN",
    "credibility": 0.6
  },
  {
    "id": 7,
    "title": "Dataiku Announces the 2025 Frontrunner Award Winners, Honoring Trailblazers Driving Agentic AI and Enterprise Transformation",
    "url": "https://www.manilatimes.net/2025/11/17/tmt-newswire/globenewswire/dataiku-announces-the-2025-frontrunner-award-winners-honoring-trailblazers-driving-agentic-ai-and-enterprise-transformation/2225587",
    "publisher": "manilatimes.net",
    "date": "2025-11-18",
    "snippet": "Celebrating organizations that turn intelligence into action and advance responsible, scalable innovation with Dataiku.",
    "content": "Dataiku Announces the 2025 Frontrunner Award Winners, Honoring Trailblazers Driving Agentic AI and Enterprise Transformation | The Manila Times Tuesday, November 18, 2025 Today's Paper Dataiku Announces the 2025 Frontrunner Award Winners, Honoring Trailblazers Driving Agentic AI and Enterprise Transformation Sign In New user? Click Here Follow us Watch Now Subscribe Sign In New user? Click Here OPINION NEWS REGIONS WORLD BUSINESS SPORTS ENTERTAINMENT LIFESTYLE THE SUNDAY TIMES SPECIAL FEATURES SPECIAL SECTIONS TMT NEWSWIRE Media OutReach Newswire PR Newswire GlobeNewswire Plentisoft FAST TIMES LEGAL ADVICE CAMPUS PRESS VIDEOS EXPATS & DIPLOMATS PHOTOS BUSINESS FORUM PODCASTS RESOURCES WEATHER MARKET OVERVIEW The Manila Times 500 EXAM RESULTS TMT DIGITAL EDITION TMT CSI TMT 127TH ANNIVERSARY QUIZZES GAMES more OPINION NEWS REGIONS WORLD BUSINESS SPORTS ENTERTAINMENT LIFESTYLE THE SUNDAY TIMES SPECIAL FEATURES SPECIAL SECTIONS TMT NEWSWIRE Media OutReach Newswire PR Newswire GlobeNewswire Plentisoft FAST TIMES LEGAL ADVICE CAMPUS PRESS VIDEOS EXPATS & DIPLOMATS PHOTOS BUSINESS FORUM PODCASTS RESOURCES WEATHER MARKET OVERVIEW The Manila Times 500 EXAM RESULTS TMT DIGITAL EDITION TMT CSI TMT 127TH ANNIVERSARY QUIZZES GAMES OPINION NEWS REGIONS WORLD BUSINESS SPORTS ENTERTAINMENT LIFESTYLE THE SUNDAY TIMES SPECIAL FEATURES SPECIAL SECTIONS TMT NEWSWIRE Media OutReach Newswire PR Newswire GlobeNewswire Plentisoft FAST TIMES LEGAL ADVICE CAMPUS PRESS VIDEOS EXPATS & DIPLOMATS PHOTOS BUSINESS FORUM PODCASTS RESOURCES WEATHER MARKET OVERVIEW The Manila Times 500 EXAM RESULTS TMT DIGITAL EDITION TMT CSI TMT 127TH ANNIVERSARY QUIZZES GAMES TMT Newswire GlobeNewswire Dataiku Announces the 2025 Frontrunner Award Winners, Honoring Trailblazers Driving Agentic AI and Enterprise Transformation By GlobeNewswire November 17, 2025 Resize Small Medium Large Latest Stories The Air Canada Best New Restaurant Top 10 List Is Here, Spotlighting the Country's Fresh and Innovative Culinary Talent GlobalFoundries Acquires Advanced Micro Foundry, Accelerating Silicon Photonics Global Leadership and Expanding AI Infrastructure Portfolio Rubicon Organics Celebrates Multiple Wins at KIND Awards 2025 GS E&C Strengthens Partnership with Amogy Through Strategic Investment to Accelerate Carbon-Free Distributed Power Innovation Globo Comunicação e Participações S.A. Announces Successful Early Results of Cash Tender Offers Celebrating organizations that turn intelligence into action and advance responsible, scalable innovation with Dataiku. NEW YORK, Nov. 17, 2025 (GLOBE NEWSWIRE) -- Dataiku , The Universal AI Platform™, today announced the winners of its 2025 Frontrunner Awards , recognizing the global innovators using Dataiku to operationalize AI responsibly and at scale. Now in its fifth year, the Frontrunner Awards celebrate Dataiku's customers, partners, and individuals who are advancing the next era of enterprise intelligence. This year's program highlights innovation across agentic AI, governance, platform modernization, and AI for good, showcasing how enterprises are moving from experimentation to production-grade AI that drives measurable transformation across various industries. \"Every year, the Frontrunner Awards give us a window into how our enterprise customers are putting AI to work responsibly and at scale,\" said Florian Douetteau, co-founder and CEO of Dataiku. \"We're seeing organizations combine human expertise with AI systems that can act, make decisions, and deliver real business impact. These Frontrunner stories show how companies are using Dataiku to turn AI innovation into real business transformation.\" The 2025 Dataiku Frontrunner Awards are: Get the latest news delivered to your inbox Sign up for The Manila Times newsletters By signing up with an email address, I acknowledge that I have read and agree to the Terms of Service and Privacy Policy . Agentic AI & Governance Excellence Recognizing organizations using Dataiku to create agentic sys",
    "credibility": 0.6
  }
]