[
  {
    "id": 1,
    "title": "How Gen Z is reshaping holiday marketing — and what brands can do about it",
    "url": "https://www.marketingdive.com/news/how-gen-z-is-reshaping-holiday-marketing-and-what-brands-can-do-about-it/805751/",
    "publisher": "marketingdive.com",
    "date": "2025-11-19",
    "snippet": "How Gen Z is reshaping holiday marketing — and what brands can do about it | Marketing Dive Skip to main content Don't miss tomorrow's marketing industry news Let Marketing Dive's free newsletter keep you informed, straight from your inbox. Daily Dive M-F Mobile Weekly Every Thur",
    "content": "How Gen Z is reshaping holiday marketing — and what brands can do about it | Marketing Dive Skip to main content Don't miss tomorrow's marketing industry news Let Marketing Dive's free newsletter keep you informed, straight from your inbox. Daily Dive M-F Mobile Weekly Every Thursday Agencies Weekly Every Monday By signing up to receive our newsletter, you agree to our Terms of Use and Privacy Policy . You can unsubscribe at anytime. Deep Dive Library Events Press Releases Topics Subscribe Search Subscribe Search Brand Strategy Mobile Creative Social Media Video Agencies Data/Analytics Influencer Marketing Ad Tech CMO Corner An article from Deep Dive How Gen Z is reshaping holiday marketing — and what brands can do about it Gen Z’s reliance on social media and influencers for product discovery remains, while new levels of comfort with retail media and AI take shape. Published Nov. 19, 2025 Jessica Hammers Editor post share post print email license Attendees and musician Khalid congregate at an Urban Outfitters holiday preview event in Los Angeles. Courtesy of Urban Outfitters Listen to the article 14 min This audio is auto-generated. Please let us know if you have feedback . The holiday season is in full swing, but what is considered by many to be the most wonderful time of the year has become a complex maze for marketers. Brands this year are tasked not only with breaking through to cash-strapped consumers, but also understanding an advertising playbook being rewritten by Gen Z, a cohort that remains valuable but is simultaneously leading a seasonal spending decline. Broad uncertainty surrounds the 2025 holidays, with 57% of consumers expecting the economy to weaken over the next six months, according to Deloitte’s annual retail survey . That’s the most negative outlook since the consultancy began tracking economic sentiment in 1997. Spending behavior reflects the dour mood, with consumers forecast to pull back 10% compared to 2024. Gen Z is expected to have an even stronger spending retreat at 34%, making it critical for brands to be intentional about how they target the cohort. “Gen Z is feeling the economic pressures at an even higher rate,” said Lupine Skelly, a retail research leader at Deloitte. “For retailers, we know that Gen Z is on the fence about a lot of things, so can you get some more marketing and these social media campaigns going to tempt them [and] talk about the value you’re offering.” As marketers attempt to strike a chord with shoppers, many are relying on themes of connection and timelessness to communicate value in place of flashier narratives. Meanwhile, bets on social media virality, influencers and in-person experiences remain popular avenues for reaching Gen Zers, who at the same time are expressing higher levels of comfort with retail media and artificial intelligence. Finding value in emotion Though the majority of consumers expect prices to be higher this season, optimism remains. Shoppers surveyed by Deloitte plan to trim seasonal extras, like a new sweater to wear while hosting, so they can preserve holiday traditions, and 70% are searching for value. To meet the moment, marketers are replacing tropes of glitz and glam with a dose of realness. “We expect consumers to be a little more budget-conscious, a little more discerning with what they’re spending, and you see that in the creative work,” said Hannah Lewman, a strategy director at Ogilvy. “Brands are responding by emphasizing the value of connection, shared experiences, more attainable human moments, less fantastical, dream holidays.” The exec pointed to Gap’s holiday marketing campaign , titled “Give Your Gift,” which centers on a 90-second ad featuring an emotional cover of the Miley Cyrus song “The Climb.” The spot, handled by Gap’s internal creative team in partnership with creative agency Invisible Dynamics, is meant to shine a light on the importance of hope, connection and individuality. “It’s not some over the top fantasy — it’s jus",
    "credibility": 0.6,
    "observed_at": "2025-12-08T16:42:49Z",
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-08T16:42:49Z",
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 0.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.442,
    "role": "support",
    "source_grade": "C",
    "tier": "context",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 2,
    "title": "Ross Stores lifts annual profit forecast on strong demand for discount goods",
    "url": "https://www.reuters.com/business/retail-consumer/ross-stores-lifts-annual-profit-forecast-strong-demand-discount-goods-2025-11-20/",
    "publisher": "reuters.com",
    "date": "2025-11-20",
    "snippet": "Ross Stores raised its annual profit forecast on Thursday, betting on resilient demand for its discounted apparel and accessories ahead of the holiday season amid looming macroeconomic uncertainties.",
    "content": "Ross Stores raised its annual profit forecast on Thursday, betting on resilient demand for its discounted apparel and accessories ahead of the holiday season amid looming macroeconomic uncertainties.",
    "credibility": 0.95,
    "observed_at": "2025-12-08T16:42:50Z",
    "region": "context",
    "domain": "pricing_promo",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-08T16:42:50Z",
      "access_issue_type": "paywall",
      "headline_only": true,
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.95,
    "recency": 0.0,
    "us_fit": 0.0,
    "quality": 0.45,
    "role": "support",
    "source_grade": "A",
    "tier": "context",
    "access_issue_type": "paywall",
    "body_text_present": false
  },
  {
    "id": 3,
    "title": "AI helps drive record $11.8 billion in Black Friday online spending",
    "url": "https://www.reuters.com/business/retail-consumer/us-consumers-spent-118-billion-black-friday-says-adobe-analytics-2025-11-29/",
    "publisher": "reuters.com",
    "date": "2025-11-29",
    "snippet": "Although U.S. consumers spent more this Black Friday compared to last year, price increases hampered online demand, according to Salesforce.",
    "content": "Although U.S. consumers spent more this Black Friday compared to last year, price increases hampered online demand, according to Salesforce.",
    "credibility": 0.95,
    "observed_at": "2025-12-08T16:42:50Z",
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-08T16:42:50Z",
      "access_issue_type": "paywall",
      "headline_only": true,
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.95,
    "recency": 0.3571428571428571,
    "us_fit": 0.6666666666666666,
    "quality": 0.45,
    "role": "support",
    "source_grade": "A",
    "tier": "context",
    "access_issue_type": "paywall",
    "body_text_present": false
  },
  {
    "id": 4,
    "title": "US economic activity little changed ahead of next Fed meeting, report shows",
    "url": "https://www.reuters.com/world/us/us-economic-activity-little-changed-ahead-next-fed-meeting-beige-book-report-2025-11-26/",
    "publisher": "reuters.com",
    "date": "2025-11-26",
    "snippet": "U.S. economic activity was little changed in recent weeks, though employment was weaker in about half of the Federal Reserve's 12 districts and consumer spending declined, the U.S. central bank said on Wednesday, likely reinforcing concerns about the job market as the next intere",
    "content": "U.S. economic activity was little changed in recent weeks, though employment was weaker in about half of the Federal Reserve's 12 districts and consumer spending declined, the U.S. central bank said on Wednesday, likely reinforcing concerns about the job market as the next interest rate decision nears.",
    "credibility": 0.95,
    "observed_at": "2025-12-08T16:42:50Z",
    "region": "US",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-08T16:42:50Z",
      "access_issue_type": "paywall",
      "headline_only": true,
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.95,
    "recency": 0.1428571428571429,
    "us_fit": 0.9666666666666666,
    "quality": 0.45,
    "role": "support",
    "source_grade": "A",
    "tier": "context",
    "access_issue_type": "paywall",
    "body_text_present": false
  },
  {
    "id": 5,
    "title": "Luxury sector to revive in 2026 but price hikes leave shoppers 'betrayed', Bain says",
    "url": "https://www.reuters.com/world/china/luxury-sector-revive-2026-price-hikes-leave-shoppers-betrayed-bain-says-2025-11-20/",
    "publisher": "reuters.com",
    "date": "2025-11-20",
    "snippet": "The global luxury goods industry is likely to sell 3% to 5% more next year after stagnating in 2025, but years of aggressive price increases have alienated customers, threatening long-term growth, Bain & Company warned on Thursday.",
    "content": "The global luxury goods industry is likely to sell 3% to 5% more next year after stagnating in 2025, but years of aggressive price increases have alienated customers, threatening long-term growth, Bain & Company warned on Thursday.",
    "credibility": 0.95,
    "observed_at": "2025-12-08T16:42:50Z",
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-08T16:42:50Z",
      "access_issue_type": "paywall",
      "headline_only": true,
      "numeric": true,
      "depth": 0.85,
      "sample_size": ""
    },
    "authority": 0.95,
    "recency": 0.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.45,
    "role": "support",
    "source_grade": "A",
    "tier": "context",
    "access_issue_type": "paywall",
    "body_text_present": false
  },
  {
    "id": 6,
    "title": "Why Gen Z Is Breaking the Mold on Holiday Spending by Choosing to Save",
    "url": "https://www.investopedia.com/why-gen-z-is-breaking-the-mold-on-holiday-spending-by-choosing-to-save-11856649",
    "publisher": "investopedia.com",
    "date": "2025-11-27",
    "snippet": "Why Gen Z Is Breaking the Mold on Holiday Spending by Choosing to Save ​ Skip to content Investopedia Live Search Please fill out this field. Newsletters Search Please fill out this field. News News Markets Companies Earnings CD Rates Mortgage Rates Economy Government Crypto Live",
    "content": "Why Gen Z Is Breaking the Mold on Holiday Spending by Choosing to Save ​ Skip to content Investopedia Live Search Please fill out this field. Newsletters Search Please fill out this field. News News Markets Companies Earnings CD Rates Mortgage Rates Economy Government Crypto Live Markets News Personal Finance View All Investing Investing Stocks Cryptocurrency Bonds ETFs Options and Derivatives Commodities Trading Automated Investing Brokers Fundamental Analysis View All Simulator Simulator Login / Portfolio Trade Research My Games Leaderboard Banking Banking Savings Accounts Certificates of Deposit (CDs) Money Market Accounts Checking Accounts View All Personal Finance Personal Finance Budgeting and Saving Personal Loans Insurance Mortgages Credit and Debt Student Loans Taxes Credit Cards Financial Literacy Retirement View All Economy Economy Government and Policy Monetary Policy Fiscal Policy Economics View All Reviews Reviews Best Online Brokers Best Crypto Exchanges Best Savings Rates Best CD Rates Best Life Insurance Best Mortgage Rates Best Robo-Advisors Best Personal Loans Best Debt Relief Companies View All Newsletters Follow Us News Markets Companies Earnings CD Rates Mortgage Rates Economy Government Crypto Live Markets News Personal Finance View All Investing Stocks Cryptocurrency Bonds ETFs Options and Derivatives Commodities Trading Automated Investing Brokers Fundamental Analysis View All Simulator Login / Portfolio Trade Research My Games Leaderboard Banking Savings Accounts Certificates of Deposit (CDs) Money Market Accounts Checking Accounts View All Personal Finance Budgeting and Saving Personal Loans Insurance Mortgages Credit and Debt Student Loans Taxes Credit Cards Financial Literacy Retirement View All Economy Government and Policy Monetary Policy Fiscal Policy Economics View All Reviews Best Online Brokers Best Crypto Exchanges Best Savings Rates Best CD Rates Best Life Insurance Best Mortgage Rates Best Robo-Advisors Best Personal Loans Best Debt Relief Companies View All Top Stories Stock Futures Tick Higher as S&P 500 Nears Record Stocks Have Rallied—But the Market's Leaders Are Changing How Investors Are Responding to the Netflix-Warner Bros. Deal A Fed Rate Cut May Be Coming—But At What Cost Why Gen Z Is Breaking the Mold on Holiday Spending by Choosing to Save By Brian Acton Full Bio Brian Acton is an experienced freelance writer and journalist who covers credit, insurance, lending, and personal finance. His work has been featured in HuffPost, TIME, The Wall Street Journal, USA Today, and other national media outlets. Learn about our editorial policies Published November 27, 2025 Gen Z is cutting back this holiday season—shopping early, spending less, and choosing secondhand. Close Key Takeaways Gen Z plans to cut holiday spending this year, prioritizing essentials and secondhand goods over gifts. This shift reflects broader financial stress and a growing focus on value-driven, practical spending. Generation Z shoppers are changing how they spend this holiday season. Rising inflation, tariffs , and tighter household budgets are making it harder to feel confident about money, according to recent consumer outlook reports. As a result, many Gen Z consumers plan to spend less on non-essential items , shop secondhand, and spread out their purchases over time. Economic Factors Affecting Holiday Spending Gen Z is feeling mounting household financial pressures going into this holiday season. Many report smaller income gains and are relying on their savings more often to cover everyday expenses. Additionally, 25% of Gen Z respondents say their financial situation has worsened compared to a year ago, according to PwC’s 2025 Holiday Outlook survey. Why This Matters to You Gen Z's shift toward more cautious, value-focused spending could influence holiday sales , product availability, and pricing trends—affecting how all generations shop this season. Understanding these changes can help you plan your budget and",
    "credibility": 0.6,
    "observed_at": "2025-12-08T16:42:51Z",
    "region": "context",
    "domain": "cultural_events",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-08T16:42:51Z",
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 0.2142857142857143,
    "us_fit": 0.0,
    "quality": 0.369,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 7,
    "title": "Holiday trends driving this year’s consumer rush",
    "url": "https://www.kpcnews.com/news/national/article_b909c4a9-70f7-5b1c-900c-fad3005ee3f8.html",
    "publisher": "kpcnews.com",
    "date": "2025-12-05",
    "snippet": "Retailers may deck the halls, but shoppers steer the season with fast-moving trends that help them make every dollar count. With 77% of buyers expecting ... Read moreThe post Holiday",
    "content": "Retailers may deck the halls, but shoppers steer the season with fast-moving trends that help them make every dollar count. With 77% of buyers expecting ... Read moreThe post Holiday",
    "credibility": 0.6,
    "observed_at": "2025-12-08T16:42:52Z",
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-08T16:42:52Z",
      "access_issue_type": "http_error",
      "headline_only": true,
      "numeric": true,
      "depth": 0.85,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 0.7857142857142857,
    "us_fit": 0.6333333333333333,
    "quality": 0.45,
    "role": "support",
    "source_grade": "C",
    "tier": "context",
    "access_issue_type": "http_error",
    "body_text_present": false
  },
  {
    "id": 8,
    "title": "Holiday Shoppers Prioritize Discounts as Budgets Tighten",
    "url": "https://www.supplychainbrain.com/articles/42929-holiday-shoppers-prioritize-discounts-as-budgets-tighten",
    "publisher": "supplychainbrain.com",
    "date": "2025-12-04",
    "snippet": "Holiday Shoppers Prioritize Discounts as Budgets Tighten | SupplyChainBrain Advertise Contact Us Supplier Directory SCB YouTube About Us Login Subscribe Logout My Profile Label LOGISTICS Air Cargo All Logistics Facility Location Planning Freight Forwarding/Customs Brokerage Globa",
    "content": "Holiday Shoppers Prioritize Discounts as Budgets Tighten | SupplyChainBrain Advertise Contact Us Supplier Directory SCB YouTube About Us Login Subscribe Logout My Profile Label LOGISTICS Air Cargo All Logistics Facility Location Planning Freight Forwarding/Customs Brokerage Global Gateways Global Logistics Last Mile Delivery Logistics Outsourcing LTL/Truckload Services Ocean Transportation Parcel & Express Rail & Intermodal Reverse Logistics Service Parts Management Transportation & Distribution TECHNOLOGY All Technology Artificial Intelligence Cloud & On-Demand Systems Data Management (Big Data/IoT/Blockchain) ERP & Enterprise Systems Forecasting & Demand Planning Global Trade Management Inventory Planning/ Optimization Product Lifecycle Management Robotics Sales & Operations Planning SC Finance & Revenue Management SC Planning & Optimization Supply Chain Visibility Transportation Management GENERAL SCM Business Strategy Alignment Customer Relationship Management Education & Professional Development Global Supply Chain Management Global Trade & Economics Green Energy HR & Labor Management Quality & Metrics Regulation & Compliance Sourcing/Procurement/SRM SC Security & Risk Mgmt Supply Chains in Crisis Sustainability & Corporate Social Responsibility WAREHOUSING All Warehouse Services Conveyors & Sortation Lift Trucks & AGVs Order Management & Fulfillment Packaging RFID, Barcode, Mobility & Voice Warehouse Automation Warehouse Management Systems INDUSTRIES Aerospace & Defense Apparel Automotive Chemicals & Energy Consumer Packaged Goods E-Commerce/Omni-Channel Food & Beverage Healthcare High-Tech/Electronics Industrial Manufacturing Pharmaceutical/Biotech Retail THINK TANK WEBINARS On-Demand Webinars Upcoming Webinars Webinar Library PODCASTS WHITEPAPERS VIDEOS Home » Holiday Shoppers Prioritize Discounts as Budgets Tighten SCB FEATURE Holiday Shoppers Prioritize Discounts as Budgets Tighten Photo: iStock / Anna Ostanina December 4, 2025 Nick Bowman, Senior Editor Consumers turned out in record numbers for the five-day Thanksgiving holiday shopping weekend, with many focusing on finding the best possible discounts and promotions, as tariffs have stretched family budgets. According to data released on December 2 by the National Retail Federation , nearly 203 million consumers shopped during the Thanksgiving holiday weekend that stretched to Cyber Monday, marking a 3% increase from 2024, and besting the previous record by 1.3%. That was helped by more than half of consumers taking advantage of early sales and promotions, as the average holiday gift budget tightened from $641 in 2024 to $628 this year. \"Consumers indicated that their purchases were specifically driven by sales and promotions, and many said free shipping, limited-time sales or promotions helped convince them to make a purchase they were initially hesitant about,\" said Prosper Insights & Analytics executive VP Phil Rist during the NRF's briefing on the holiday weekend shopping numbers. The ways that shoppers are paying for holiday gifts is further demonstrating just how budget-conscious families have become, with Adobe Digital Insights tracking a 4.2% year-over-year increase in the use of \"buy-now/pay-later\" (BNPL) credit services on Cyber Monday. Adobe also projects BNPL spending to hit $20.2 billion between November 1 and December 31, which would represent an 11% increase over that same period in 2024, and set a new high water mark for BNPL usage during the holiday shopping season. Additionally, outstanding credit card balances rose to an all-time high of $1.23 trillion in the third quarter of 2025, marking a 6% increase from that same quarter last year. Although larger retailers reported strong numbers over Thanksgiving weekend, it's been a different story for small business owners. A survey of more than 1,000 small businesses from the Small Business for America's Future nonprofit found that 71% of respondents expect tariffs to have a negative impact on consumer",
    "credibility": 0.6,
    "observed_at": "2025-12-08T16:42:52Z",
    "region": "context",
    "domain": "pricing_promo",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-08T16:42:52Z",
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 0.7142857142857143,
    "us_fit": 0.6333333333333333,
    "quality": 0.62,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 9,
    "title": "Analysis-Strong Start to Online Holiday Shopping Masks Signs of a Fragile U.S. Consumer",
    "url": "https://money.usnews.com/investing/news/articles/2025-12-02/analysis-strong-start-to-online-holiday-shopping-masks-signs-of-a-fragile-u-s-consumer",
    "publisher": "money.usnews.com",
    "date": "2025-12-02",
    "snippet": "Record top-line sales should be taken \"with a pinch of salt,\" said John Mercer, head of global research at consumer analytics firm Coresight. Costs have risen, in part due to tariffs, and wealthy shoppers \"have been holding up retail all year,\" Mercer said.",
    "content": "Record top-line sales should be taken \"with a pinch of salt,\" said John Mercer, head of global research at consumer analytics firm Coresight. Costs have risen, in part due to tariffs, and wealthy shoppers \"have been holding up retail all year,\" Mercer said.",
    "credibility": 0.6,
    "observed_at": "2025-12-08T16:42:57Z",
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-08T16:42:57Z",
      "access_issue_type": "timeout",
      "headline_only": true,
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 0.5714285714285714,
    "us_fit": 0.3333333333333333,
    "quality": 0.45,
    "role": "support",
    "source_grade": "C",
    "tier": "context",
    "access_issue_type": "timeout",
    "body_text_present": false
  }
]