[
  {
    "id": 1,
    "title": "When Holiday Ads Start Giving Back",
    "url": "https://www.mytotalretail.com/article/when-holiday-ads-start-giving-back/",
    "publisher": "mytotalretail.com",
    "date": "2025-11-20",
    "snippet": "Every holiday season our screens fill with commercials promising joy. But lately, they’re also offering something deeper: the chance to give back. As the holiday lights flicker on and streaming screens light up with cheerful classics and binge‑worthy new releases,",
    "content": "Every holiday season our screens fill with commercials promising joy. But lately, they’re also offering something deeper: the chance to give back. As the holiday lights flicker on and streaming screens light up with cheerful classics and binge‑worthy new releases,",
    "credibility": 0.6,
    "region": "context",
    "domain": "cultural_events",
    "source_type": "analysis",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.0,
    "quality": 0.565,
    "role": "support",
    "source_grade": "C"
  },
  {
    "id": 2,
    "title": "You’re Invited to Eater’s Pop-Up Holiday Market",
    "url": "https://www.eater.com/press-room/925041/eater-under-wraps-holiday-market-new-york-2025",
    "publisher": "eater.com",
    "date": "2025-11-20",
    "snippet": "Ready to head home for the holidays, but need to get your gift shopping done first? Eater has you covered. On December 13 and ...",
    "content": "Ready to head home for the holidays, but need to get your gift shopping done first? Eater has you covered. On December 13 and ...",
    "credibility": 0.6,
    "region": "context",
    "domain": "cultural_events",
    "source_type": "analysis",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.0,
    "quality": 0.565,
    "role": "support",
    "source_grade": "C"
  },
  {
    "id": 3,
    "title": "Winning The $500 Holiday: How To Grow When Shoppers Spend Less",
    "url": "https://www.forbes.com/councils/forbesbusinesscouncil/2025/11/18/winning-the-500-holiday-how-to-grow-when-shoppers-spend-less/",
    "publisher": "forbes.com",
    "date": "2025-11-20",
    "snippet": "Appealing to conscious consumers and capturing a share of the $500 holiday will require a strategic approach that mixes value, convenience and the right messaging.",
    "content": "Winning The $500 Holiday: How To Grow When Shoppers Spend Less Newsletters Games Share a News Tip Featured Featured Breaking News White House Watch Daily Cover Stories America's 2025 Top Wealth Management Teams Private Wealth List | Paid Program The Forbes CIO Next List: 2025 | Paid Program America's 2025 Top Wealth Management Teams High Net Worth List When Teens Fundraise To End Blood Cancer, They Change Lives, Including Their Own | Paid Program The Employee Well-Being Imperative | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Visa Infinite Asia Pacific: Getting Away, Their Own Way | Paid Program Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Next Billion-Dollar Startups 2025 Four Reasons To Rethink Your Savings Strategy Meet The Young Tech Trailblazers Building a New Future for Language, Learning and Medicine America's Most Powerful Women In Sports Navigating Retirement In Today’s Economic Landscape Get Your Data AI-Ready | Paid Program Streamline, Secure, Innovate: Inside Three Organizations That Rewired Their Networks For What’s Next | Paid Program CxO Spotlight: Innovation in Healthcare Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All Employee and Customer Experience The New Brand Growth Formula: A Data-Driven Culture Fueled By AI | Paid Program Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Money Money See All ETF Investing Trends Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitchen & Dining Outdoor Pets Storage & Organization Tools Wine & Bar Fashion Accessories Clothing Eyewear Footwear Jewelry Handbags & Purses Lingerie & Sleepwear Outdoor & Fitness Apparel Outerwear Watches Kids & Baby Gear Baby Gear Kids Clothes & Accessories Nursery Pregnancy & Postpartum Toys",
    "credibility": 0.65,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": true,
      "depth": 0.85,
      "sample_size": ""
    },
    "authority": 0.65,
    "recency": 1.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.754,
    "role": "support",
    "source_grade": "C"
  },
  {
    "id": 4,
    "title": "How Gen Z is reshaping holiday marketing — and what brands can do about it",
    "url": "https://www.marketingdive.com/news/how-gen-z-is-reshaping-holiday-marketing-and-what-brands-can-do-about-it/805751/",
    "publisher": "marketingdive.com",
    "date": "2025-11-20",
    "snippet": "The cohort’s allegiance to social media and influencers for product discovery remains, while new levels of comfort with retail media and AI take shape.",
    "content": "How Gen Z is reshaping holiday marketing — and what brands can do about it | Marketing Dive Skip to main content CONTINUE TO SITE ➞ Don't miss tomorrow's marketing industry news Let Marketing Dive's free newsletter keep you informed, straight from your inbox. Daily Dive M-F Mobile Weekly Every Thursday Agencies Weekly Every Monday By signing up to receive our newsletter, you agree to our Terms of Use and Privacy Policy . You can unsubscribe at anytime. Deep Dive Library Events Press Releases Topics Subscribe Search Subscribe Search Brand Strategy Mobile Creative Social Media Video Agencies Data/Analytics Influencer Marketing Ad Tech CMO Corner An article from Deep Dive How Gen Z is reshaping holiday marketing — and what brands can do about it Gen Z’s reliance on social media and influencers for product discovery remains, while new levels of comfort with retail media and AI take shape. Published Nov. 19, 2025 Jessica Hammers Editor post share post print email license Attendees and musician Khalid congregate at an Urban Outfitters holiday preview event in Los Angeles. Courtesy of Urban Outfitters Listen to the article 13 min This audio is auto-generated. Please let us know if you have feedback . The holiday season is in full swing, but what is considered by many to be the most wonderful time of the year has become a complex maze for marketers. Brands this year are tasked not only with breaking through to cash-strapped consumers, but also understanding an advertising playbook being rewritten by Gen Z, a cohort that remains valuable but is simultaneously leading a seasonal spending decline. Broad uncertainty surrounds the 2025 holidays, with 57% of consumers expecting the economy to weaken over the next six months, according to Deloitte’s annual retail survey . That’s the most negative outlook since the consultancy began tracking economic sentiment in 1997. Spending behavior reflects the dour mood, with consumers forecast to pull back 10% compared to 2024. Gen Z is expected to have an even stronger spending retreat at 34%, making it critical for brands to be intentional about how they target the cohort. “Gen Z is feeling the economic pressures at an even higher rate,” said Lupine Skelly, a retail research leader at Deloitte. “For retailers, we know that Gen Z is on the fence about a lot of things, so can you get some more marketing and these social media campaigns going to tempt them [and] talk about the value you’re offering.” As marketers attempt to strike a chord with shoppers, many are relying on themes of connection and timelessness to communicate value in place of flashier narratives. Meanwhile, bets on social media virality, influencers and in-person experiences remain popular avenues for reaching Gen Zers, who at the same time are expressing higher levels of comfort with retail media and artificial intelligence. Finding value in emotion Though the majority of consumers expect prices to be higher this season, optimism remains. Shoppers surveyed by Deloitte plan to trim seasonal extras, like a new sweater to wear while hosting, so they can preserve holiday traditions, and 70% are searching for value. To meet the moment, marketers are replacing tropes of glitz and glam with a dose of realness. “We expect consumers to be a little more budget-conscious, a little more discerning with what they’re spending, and you see that in the creative work,” said Hannah Lewman, a strategy director at Ogilvy. “Brands are responding by emphasizing the value of connection, shared experiences, more attainable human moments, less fantastical, dream holidays.” The exec pointed to Gap’s holiday marketing campaign , titled “Give Your Gift,” which centers on a 90-second ad featuring an emotional cover of the Miley Cyrus song “The Climb.” The spot, handled by Gap’s internal creative team in partnership with creative agency Invisible Dynamics, is meant to shine a light on the importance of hope, connection and individuality. “It’s not some over the top",
    "credibility": 0.6,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.692,
    "role": "support",
    "source_grade": "C"
  },
  {
    "id": 5,
    "title": "YouTube Holiday Trends: Content, Context, and Behavior",
    "url": "https://www.mytotalretail.com/article/youtube-holiday-trends-content-context-and-behavior/",
    "publisher": "mytotalretail.com",
    "date": "2025-11-20",
    "snippet": "YouTube advertising campaigns can have a ripple effect across the rest of your channels, especially if your ad is aligned ...",
    "content": "YouTube Holiday Trends: Content, Context, and Behavior Continue to your page in 15 seconds or skip this ad . Jobs Resource Guide Advertise The Retailer's Source for Content & Community Topics Brick-and-Mortar E-Commerce Management Marketing Merchandising Mobile Omnichannel Operations & Fulfillment Professional Development Technology Events Live Events Total Retail Tech Total Retail Roundtables WIRLC On the Road Women In Retail Leadership Summit Industry Event Calendar Webinars Virtual Exchange November 2025 January 2025 July 2024 Browse All Women In Retail Leadership Summit Podcasts Total Retail Talks Total Retail Tech Insights Videos Blogs Tim Ash Reggie Brady Jim Gilbert Maria Haggerty George Hague Stephen R. Lett Rob Martinez Susan J. Mcintyre Joe Palzkill Resources Top 50 Tips of 2024 2024 Retail Technology Report Top 50 Fastest-Growing Retailers Browse Resources Add a Resource Research Subscribe Total Retail Report newsletter Marketing November 19, 2025 YouTube Holiday Trends: Content, Context, and Behavior Credit: YouTube By Hitesh Chawla Facebook Facebook Twitter Twitter LinkedIn LinkedIn Email Email With over 2.7 billion monthly users, YouTube is now the No. 1 most-visited mobile app and the No. 2 most-visited mobile video app (right after TikTok). Not to mention the No. 1 destination for podcasts as well as streaming. Users watch more than 1 billion hours of content on YouTube every day. Therefore, if you’re trying to reach your audience (or a new audience!) with holiday ad campaigns, they’re probably on YouTube. We often don’t think of YouTube as a performance channel, but the data tells a different story. Earlier this year, Haus proved that YouTube drives a significant halo effect to overall performance. After testing nearly 200 direct-to-consumer (DTC) campaigns, the team showed that YouTube drives 85 percent higher lift against new customer key performance indicators than repeat customer KPIs. New customers from YouTube were 76 percent of the overall DTC sales impact. Retail is even better: YouTube drives an additional sales lift of 99 percent across physical stores and third-party websites. So, yes, YouTube can drive dollars during the holidays. But what are people watching? What does the YouTube shopping journey look like? That’s what Silverpush wanted to find out with its latest report . ‘Tis the Season for Context Ahead of the holidays, Silverpush analyzed its YouTube datasets to understand the different types of content, context, and behavior on the platform. The Silverpush Contextual Engine identifies contextual signals in each video (product, influencer, topic, theme, location, sentiment, etc.) and categorizes them into different contextual tactics. We applied retail, shopping, and holiday parameters to sort and categorize the types of content most relevant for retailers and brands. We found that there have been more than 724 billion views across retail and shopping videos on YouTube this year. That’s a 54 percent increase year-over-year. Consumers aren’t just using YouTube for education or entertainment. YouTube is often a shopping guide, too. Here are the kinds of videos that have seen the most growth this year: Shopping vlogs (58 percent) Product reviews (54 percent) Fashion hauls (50 percent) Tech unboxings (45 percent) Live shopping streams (40 percent) How-to- and tutorials (37 percent) Listicles and roundups (35 percent) This ecosystem of shopping and retail videos is further divided across different product categories. Here are the fastest-growing retail categories on YouTube: Beauty and Wellness (17 percent) Fashion and Accessories (13.5 percent) Home and Decor (13.5 percent) Electronics and Gadgets (11.9 percent) Luxury (11.7 percent) So how can retailers make the most of this data? What kind of ad strategy would work the best? That all depends on your target audience. By setting up our contextual targeting strategy across this dataset, we also looked at the most common personas and what kind of v",
    "credibility": 0.6,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.0,
    "quality": 0.565,
    "role": "support",
    "source_grade": "C"
  },
  {
    "id": 6,
    "title": "18 Iowa Recipes That Locals Defend Like Small-Town Secrets",
    "url": "https://everafterinthewoods.com/iowa-recipes-that-locals-defend-like-small-town-secrets/",
    "publisher": "everafterinthewoods.com",
    "date": "2025-11-20",
    "snippet": "These Iowa comfort food favorites are so good, locals defend them like family secrets passed down for decades.",
    "content": "18 Iowa Recipes That Locals Defend Like Small-Town Secrets Skip to content ABOUT Expand Contact Privacy Policy Terms Of Use FOOD Expand Recipes Restaurants Regional Nutrition Nostalgia Reviews ENTERTAINMENT Expand kids disney product parties movie DIY TRAVEL Toggle Menu Search Recipes 18 Iowa Recipes That Locals Defend Like Small-Town Secrets By Ben Lane November 15, 2025 November 12, 2025 Iowa’s kitchen tables hold recipes that rarely make it onto fancy restaurant menus, yet they carry more pride than any five-star plating ever could. I grew up watching neighbors guard their cooking methods like treasure maps, passing down techniques through hushed conversations at church suppers and county fairs. These dishes aren’t about impressing food critics; they’re about feeding families, celebrating harvests, and honoring the immigrant roots that shaped this state’s culinary identity. Mention any of these eighteen recipes to an Iowan, and you’ll witness fierce loyalty mixed with childhood nostalgia. That is why they are so special. 1. Breaded Pork Tenderloin Sandwich © – Let’s Go Iowa Pounded until it’s practically transparent, this pork loin gets a thick breading coat before hitting hot oil. The result hangs over the bun like an edible umbrella, demanding respect and a strategy for eating. Every Iowa diner has its own take, but the non-negotiables remain: pickles, onions, and a smear of yellow mustard. I once tried to order mine without pickles at a truck stop near Cedar Rapids, and the waitress looked at me like I’d insulted her grandmother. The sheer size makes it Instagram-worthy, but locals have been devouring these long before social media existed. 2. Steak de Burgo © Carne Diem Des Moines claims this tenderloin treasure, and the city defends it fiercely. Chunks of beef swim in a garlic-butter sauce spiked with Italian herbs, creating a dish that feels fancy without requiring a tuxedo. Most restaurants serve it with a crusty bread for soaking up every drop of that garlicky goodness. I remember my first bite at a downtown steakhouse, wondering why this hadn’t conquered the entire Midwest yet. It’s proof that Iowa can do upscale comfort food when the mood strikes, elevating simple ingredients into something memorable. 3. Hot Beef Sundae © WG MeatBox Someone in Iowa looked at roast beef, mashed potatoes, and gravy, then decided to stack them like dessert. The result sits somewhere between brilliant and bizarre, served in a glass with a cherry tomato perched on top instead of a maraschino. County fairs and festivals embrace this quirky creation, and locals order it without a trace of irony. The layers mirror an ice cream sundae’s structure, but the savory flavors keep your taste buds thoroughly confused in the best way. It’s comfort food with a sense of humor. 4. Sloppy Joe Pizza © Thursday Night Pizza Ground beef meets pizza crust meets taco toppings in this Iowa hybrid that shouldn’t work but absolutely does. Seasoned meat spreads across the dough, then gets piled with cheese, lettuce, and tomatoes like a deconstructed taco. My cousin in Sioux City serves this at every family gathering, and the pan empties within minutes. Critics might call it confused, but Iowans call it efficient: why choose between pizza and tacos when you can have both? It’s the culinary equivalent of refusing to pick sides. 5. Sweet Corn on the Cob © Eden Ridge Acres When August rolls around and Iowa’s cornfields reach peak sweetness, locals race to get those ears into boiling water. The fresher the better, ideally picked that same morning and cooked within hours. Butter and salt are the only acceptable additions; anything else is considered agricultural blasphemy. The kernels burst with natural sugar, making Iowa sweet corn a seasonal event people mark on their calendars. Roadside stands pop up everywhere, and families buy by the dozen, knowing these ears won’t last long once the season shifts. 6. Iowa Pork Chop © Dinner at the Zoo Cut thick from the lower b",
    "credibility": 0.6,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": true,
      "depth": 0.85,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.732,
    "role": "support",
    "source_grade": "C"
  },
  {
    "id": 7,
    "title": "Value tops shoppers’ wish lists this holiday season in new survey",
    "url": "https://www.marketingdive.com/news/value-tops-shoppers-wish-lists-this-holiday-season-in-new-survey/805744/",
    "publisher": "marketingdive.com",
    "date": "2025-11-20",
    "snippet": "Gen Z is the most likely to shop physical stores this season, at a rate of 91%, according to new data from Mastercard.",
    "content": "Value tops shoppers’ wish lists this holiday season in new survey | Marketing Dive Skip to main content CONTINUE TO SITE ➞ Don't miss tomorrow's marketing industry news Let Marketing Dive's free newsletter keep you informed, straight from your inbox. Daily Dive M-F Mobile Weekly Every Thursday Agencies Weekly Every Monday By signing up to receive our newsletter, you agree to our Terms of Use and Privacy Policy . You can unsubscribe at anytime. Deep Dive Library Events Press Releases Topics Subscribe Search Subscribe Search Brand Strategy Mobile Creative Social Media Video Agencies Data/Analytics Influencer Marketing Ad Tech CMO Corner An article from Dive Brief Value tops shoppers’ wish lists this holiday season in new survey Gen Z is the most likely to shop in physical stores this season, at a rate of 91%, according to new data from Mastercard. Published Nov. 19, 2025 Sara Karlovitch Staff Reporter post share post print email license The top emotions consumers are feeling when it comes to holiday shopping are excitement, at 45%, and connection, at 28%. Getty Images Listen to the article 3 min This audio is auto-generated. Please let us know if you have feedback . Dive Brief: Value for money is the most important factor for consumers when it comes to holiday purchases, followed by product quality and discounts, according to data from Mastercard’s Shopper Snapshot shared with Marketing Dive. With the focus placed squarely on value, sales and discounts have become a driving force when it comes to consumer purchases. Among survey respondents, 73% routinely purchase a wish list item once it goes on sale, 71% respond to personalized discount codes and 63% act when limited-time sales are ending. Consumers are using artificial intelligence as a digital helping hand this holiday season. Approximately half of Gen Z and millennials would let AI handle gift buying if it meant avoiding holiday stress. Additionally, 42% of consumers are already using the technology to assist with buying gifts Dive Insight: With consumers starting their holiday shopping earlier and earlier, marketers have been focused on timing campaigns to capture buyer attention. Brands have taken a variety of approaches. For example, Home Depot tugged at heartstrings with ads showcasing Christmas tree farmers while Walmart tapped into seasonal nostalgia with ads featuring the Grinch. However, data from Mastercard found above all else, consumers are looking for value this holiday season. Mastercard’s “Shopper Snapshot 2025: Holiday Shopping Insights” report is based on responses from 4,007 consumers from the U.S., Canada, the U.K and the UAE. It was conducted in partnership with The Harris Poll. Consumers are looking to cash in on rewards this season, with 79% of respondents planning on using loyalty points and rewards to complete purchases. The hunt for value could provide a way to collect first party data, with 66% of respondents saying they regularly provide their contact information in order to receive a discount during the holidays, per the report. Social commerce is becoming a more trusted outlet for consumers, with 57% of Gen Z and 61% of millennials saying their trust in the channel has increased. Additionally, 53% of Gen Z consumers and 47% of millennials report trusting the opinion of influencers over their own friends. While online and social shopping is growing in popularity, consumers are still flocking to physical stores, with 90% of consumers most often frequenting physical stores for holiday shopping. Gen Z is actually the most likely to shop physical stores, at a rate of 91%. Physical stores offer Gen Z consumers with inspiration, with 81% reporting getting gift ideas from displays. E-commerce sites are the second most used source for holiday shopping for 82% of consumers. This jumps to 87% when looking at Gen Z and 86% when looking at millennials. Approximately two-thirds of Gen Z and millennial consumers plan to increase or maintain their purchasing of ",
    "credibility": 0.6,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": true,
      "depth": 0.85,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.732,
    "role": "support",
    "source_grade": "C"
  },
  {
    "id": 8,
    "title": "A Tale of Two Pop-Ups: Amazon, Primark Aim to Capture NYC Holiday Magic",
    "url": "https://www.retailtouchpoints.com/topics/retail-store-design/experiential-retail/a-tale-of-two-pop-ups-amazon-primark-aim-to-capture-nyc-holiday-magic",
    "publisher": "retailtouchpoints.com",
    "date": "2025-11-20",
    "snippet": "Two takes on the holiday pop-up, from Amazon and Primark, present an interesting study of the model’s variability and utility.",
    "content": "A Tale of Two Pop-Ups: Amazon, Primark Aim to Capture NYC Holiday Magic - Retail TouchPoints Emerald Media Network Advertise Linkedin X-twitter Facebook Instagram Youtube Advertisement Latest Resources View All Resources Research Reports iPapers Webinars Events Digital Event Digital Event Tradeshow Digital Event Digital Event Podcast ThinkTank Hub Latest Resources View All Resources Research Reports iPapers Webinars Events Podcast ThinkTank Hub About Us Advertise With Us Blog Awards TouchPoints TV Privacy Policy Subscribe Trending Listen Now: What DoorDash Plans to Deliver Next A Tale of Two Pop-Ups: Amazon, Primark Aim to Capture NYC Holiday Magic Is Retail Ready for a World Where Crypto is just Another Way to Pay? Facebook Marketplace Beefs up Fashion Offerings with Ebay, Poshmark Integrations Walmart Names Furner to Replace Retiring McMillon as CEO This Fish Story is True: How Fulton Fish Market Became an Ecommerce Whale Search Search A Tale of Two Pop-Ups: Amazon, Primark Aim to Capture NYC Holiday Magic November 18, 2025 at 11:09 AM EST By Nicole Silberstein Inside Amazon's Home for the Holidays pop-up in NYC. (Retail TouchPoints) The holiday season is replete with holly, garland, sales…and pop-ups, especially in high-traffic tourist destinations like New York City. This year, two takes on the holiday pop-up, from Amazon and Primark , present an interesting study of the model’s variability and utility. The two companies took markedly different approaches to their pop-up experiences, although neither activation supported on-site sales. Online-only Amazon highlighted its Holiday Shop offerings in a richly decorated, three -story, three -day pop-up adjacent to tourist hotspot Bryant Park., Primark has opened a small “Studio” space in the NYU-dominated NoHo neighborhood that will remain open through the holidays and beyond, aimed at building buzz for the Spring 2026 opening of its Herald Square flagship . Two very different companies (not least because one dominates U.S. ecommerce and the other has no ecommerce at all) with two very different goals, and yet they both turned to non-transactional pop-ups to achieve their aims. Here’s how these varying expressions of the pop-up model played out. Amazon Brings its Holiday Shop to Life The “home theater” room in Amazon’s Home for the Holidays pop-up. (Retail TouchPoints) Amazon’s first-ever “Home for the Holidays Social Content Studio” was staged from Nov 10-14 at GH on the Park , an event space that at one point in time, long ago, was a stately home overlooking Bryant Park. For the event, Amazon transformed the three stories of the space back into a home, albeit with a modern bent. Advertisement Fully decorated themed rooms included a kitchen and walk-in pantry, dining room, “boudoir” lounge area, playroom, theater, home office and gym. Each area was stuffed to the brim with products from Amazon’s Holiday Shop , with QR codes placed throughout to “shop” the products on display. Image: Retail TouchPoints However, the goal of the event wasn’t sales. Rather, it was a chance for Amazon to break out from the expansive yet restrictive walls of the internet. The pop-up goal was to bring Amazon’s online assortment to life for media and influencers, all busily preparing their holiday hot lists and seasonal shopping recommendations. The idea was to create an immersive experience (which it certainly was) that not only allowed for product trials but also created opportunities for content creation and “photo moments.” Amazon also took the opportunity to highlight its climate-friendly product offerings with a dedicated sustainability section that featured products from its Climate Pledge Friendly program and Amazon Resale , including a curated Climate Pledge Fashion Edit available on Amazon-owned Shopbop . Primark Builds Buzz for Herald Square Store Image: Retail TouchPoints Downtown, Primark hosted its own very different pop-up, the Primark Studio, at 55 Great Jones Street in NoHo. The locati",
    "credibility": 0.78,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.78,
    "recency": 1.0,
    "us_fit": 0.0,
    "quality": 0.646,
    "role": "support",
    "source_grade": "B"
  },
  {
    "id": 9,
    "title": "The Pop-Tarts Bowl is 'upping the ante' with even more pastry mascots to toast",
    "url": "https://www.msn.com/en-us/sports/other/the-pop-tarts-bowl-is-upping-the-ante-with-even-more-pastry-mascots-to-toast/ar-AA1QLbbr?ocid=BingNewsVerp",
    "publisher": "msn.com",
    "date": "2025-11-20",
    "snippet": "Fans will now be a part of the viral Pop-Tarts Bowl experience, voting on which edible mascots will be toasted for players to ...",
    "content": "MSN",
    "credibility": 0.6,
    "region": "context",
    "domain": "general",
    "source_type": "aggregator",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.45,
    "recency": 1.0,
    "us_fit": 0.0,
    "quality": 0.497,
    "role": "support",
    "source_grade": "D"
  }
]