[
  {
    "id": 1,
    "title": "How Agencies Prove Their Value In An In-House Marketing World",
    "url": "https://www.forbes.com/councils/forbesagencycouncil/2025/12/10/how-agencies-prove-their-value-in-an-in-house-marketing-world/",
    "publisher": "forbes.com",
    "date": "2025-12-10",
    "snippet": "How Agencies Prove Their Value In An In-House Marketing World Newsletters Games Share a News Tip Featured Featured Breaking News White House Watch Daily Cover Stories Forbes 2026 Top Hospitals List Formula 1’s Highest-Paid Drivers 2025 Americans Want To Recycle More – But Aren’t.",
    "content": "How Agencies Prove Their Value In An In-House Marketing World Newsletters Games Share a News Tip Featured Featured Breaking News White House Watch Daily Cover Stories Forbes 2026 Top Hospitals List Formula 1’s Highest-Paid Drivers 2025 Americans Want To Recycle More – But Aren’t. Here’s How To Turn Good Intentions Into Action | Paid Program How Innovation Can Streamline Expense Management And B2B Transactions | Paid Program Celebrating Top Fundraisers Uniting To End Blood Cancers | Paid Program America's 2025 Top Wealth Management Teams Private Wealth List The Forbes CIO Next List: 2025 | Paid Program America's 2025 Top Wealth Management Teams High Net Worth List When Teens Fundraise To End Blood Cancer, They Change Lives, Including Their Own | Paid Program The Employee Well-Being Imperative | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Next Billion-Dollar Startups 2025 Four Reasons To Rethink Your Savings Strategy America's Most Powerful Women In Sports Navigating Retirement In Today’s Economic Landscape Forbes Iconoclast: How Top Investors Find Opportunities In Times Of Uncertainty The Joy Of Checking Out The Performance Layer | Paid Program Do You Know The True Cost Of Your Legacy Finance Tech? Take This Quiz To Find Out | Paid Program CXO Spotlight | Paid Program Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All AI-Powered Cybersecurity Employee and Customer Experience The New Brand Growth Formula: A Data-Driven Culture Fueled By AI | Paid Program Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Dell Technologies BrandVoice | Paid Program Money Money See All ETF Investing Trends Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Luxury Travel Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbi",
    "credibility": 0.65,
    "observed_at": "2025-12-13T23:03:36Z",
    "region": "US",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-13T23:03:36Z",
      "numeric": true,
      "depth": 0.85,
      "sample_size": ""
    },
    "authority": 0.65,
    "recency": 0.7857142857142857,
    "us_fit": 0.9666666666666666,
    "quality": 0.767,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 2,
    "title": "AI likely to drive record Cyber Monday sales - LinkedIn",
    "url": "https://www.linkedin.com/news/story/ai-likely-to-drive-record-cyber-monday-sales-6781852/",
    "publisher": "linkedin.com",
    "date": "unknown",
    "snippet": "AI likely to drive record Cyber Monday sales | LinkedIn Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Skip to main content LinkedIn Top Content People Learning Jobs Games Join now Sign ",
    "content": "AI likely to drive record Cyber Monday sales | LinkedIn Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Skip to main content LinkedIn Top Content People Learning Jobs Games Join now Sign in AI likely to drive record Cyber Monday sales Report this article Megan McDonough Megan McDonough Published Nov 30, 2025 + Follow The stage is set for a promising Cyber Monday after American consumers spent a record $11.8 billion online on Black Friday, Reuters reports. December 1 is projected to generate a whopping $14.2 billion in sales. Adobe, which tracks retail data, says bargain-hunters should watch for deep discounts on electronics, apparel and computers. The demand for digital shopping has surged significantly, with AI-driven retail traffic soaring 805% year-over-year. Editors’ Picks Anne D'Innocenzio 1w Edited Report this post Major retail chains and tech companies are offering new or updated artificial intelligence tools in time for the holiday shopping season, hoping to give consumers an easier gift-buying experience and themselves an augmented share of online spending. Although AI-powered purchases are in early stages, the shopping assistants and agents rolled out by the likes of Walmart, Amazon and Google can do more than the chatbots of holidays past. The latest versions were designed to provide personalized product recommendations, track prices and to place some orders through unscripted “conversations” with customers. Those features are on top of shopping updates from AI platforms like OpenAI’s ChatGPT and Google Gemini. In one of the season’s most talked-about launches, Google this month introduced an AI agent that can be instructed to call local stores to ask if a desired product is in stock. Despite the advancements, AI’s impact on holiday shopping will be “relatively limited” this year since not every shopping site has useful tools and not every shopper is willing to try them, said Brad Jashinsky, a senior retail industry analyst at information technology research and consulting firm Gartner. “The more retailers that launch these tools, the better they get, and the more that consumers get comfortable and start to seek them out,” Jashinsky said. “But customer behavior takes a long time to change.” my take ICYMI from Sunday.. The Associated Press AI-assisted shopping is the talk of the holiday shopping season apnews.com 47 24 Comments Like Comment Share To view or add a comment, sign in Ananya Mariam Rajesh 1w Report this post Shopping isn’t what it used to be. No, demand hasn’t evaporated, but retailers are feeling the strain as fewer customers make the trip to browse shelves in person. Instead, more Americans are staying home and filling online carts, helped along by ChatGPT and other AI chatbots now woven into many companies’ e-commerce systems. According to Salesforce data, $14.2 billion in global online sales and $3 billion in U.S. online sales were driven by AI & agents on Black Friday, as more shoppers turned to AI chatbots for their shopping queries. But foot traffic at stores declined sharply. According to RetailNext, the data shows an average 5.3% year-over-year decrease in in-store foot traffic across Black Friday and Saturday. For Stocktwits with Ramakrishnan M https://lnkd.in/gm8PEgP9 AI Is Quietly Rewriting Black Friday — More Shoppers Are Now Skipping Store Visits For Online Deals stocktwits.com 28 1 Comment Like Comment Share To view or add a comment, sign in Bri Bennett 1w Report this post Cyber Monday is tomorrow and I already feel like I've run a marathon in a mall. Every brand is screaming \"sale,\" I'm tired of trying to figure out the best deals, and the only things getting my attention are the ones that make the decision easier, not louder. A few early signals from Black Friday 2025 we've been observing at Cobalt Strategy Group : 🔹 Black Friday online sales hit a record $11.8B, up 9.1% year over year. People are",
    "credibility": 0.6,
    "observed_at": "2025-12-13T23:03:38Z",
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-13T23:03:38Z",
      "numeric": false,
      "depth": 0.45,
      "sample_size": "",
      "rescued_from": "https://www.reuters.com/business/retail-consumer/us-consumers-spent-118-billion-black-friday-says-adobe-analytics-2025-11-29/",
      "rescue_title": "AI helps drive record $11.8 billion in Black Friday online spending"
    },
    "authority": 0.6,
    "recency": 0.8,
    "us_fit": 0.6333333333333333,
    "quality": 0.642,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 3,
    "title": "US economy Latest News & Headlines - The Business Times",
    "url": "https://www.businesstimes.com.sg/keywords/us-economy",
    "publisher": "businesstimes.com.sg",
    "date": "2025-12-12",
    "snippet": "US economy Latest News & Headlines - The Business Times Search US economy Follow Banking & Finance Fed officials split over risks to US economy going into 2026 The Fed cut its benchmark rate by a quarter percentage point for a third consecutive meeting in response to rising unemp",
    "content": "US economy Latest News & Headlines - The Business Times Search US economy Follow Banking & Finance Fed officials split over risks to US economy going into 2026 The Fed cut its benchmark rate by a quarter percentage point for a third consecutive meeting in response to rising unemployment Opinion & Features Trump’s trade war and the persistence of magical thinking The tariffs have been effective at one thing: generating political theatre while imposing costs on American households and businesses International US trade deficit unexpectedly shrinks to smallest since 2020 US exports rose 3% to the second-highest level on record, imports increased a more modest 0.6% International US weekly jobless claims surge amid seasonal adjustment challenges Initial claims for state unemployment benefits jumped 44,000 to a seasonally adjusted 236,000 for the week ended Dec 6 Companies & Markets NEWS ANALYSIS More dissenters could signal increased resistance to future Fed rate cuts Investors should be positioned for the Fed to continue easing at least once more in 2026, say analysts Banking & Finance Divided US Fed lowers rates by 25 bps, signals pause and one 2026 cut as growth rebounds The pace of price increases has risen steadily from 2.3 per cent in April, above the Fed’s 2 per cent inflation target International Growth in US labour costs slows in Q3 The Employment Cost Index rose 0.8% in the last quarter, Banking & Finance Fed chair front-runner Hassett says ‘plenty of room’ to cut rates [WASHINGTON] White House economic adviser Kevin Hassett, the front-runner to be the Federal Reserve’s next chair, told the WSJ CEO Council on Tuesday there is “plenty of room” to cut interest rates fu... International US job openings increase modestly in October Labour market stagnation has been blamed on reduced labour supply amid a reduction in immigration International Small US businesses more optimistic on sales outlook However, they are less upbeat about the economic outlook Popular Topics Banks & Currency News Singapore Companies News Singapore Economy News Latest REITs News Property News Latest T-bills Treasury Bills Results & Interest News Latest SSB Singapore Savings Bonds News Latest COE Certificate of Entitlement News Latest Johor-Singapore SEZ News Latest BTO Build To Order & Sales of Balance News Latest STI Straits Times Index News Latest SGX Dividends, Share Price News Latest Bonds Market News Latest Singapore Stocks To Buy News Latest Singapore Economy News View More Credit Suisse Share Price, Dividends & News UBS Share Price, Dividends & News UOB Share Price, Dividends & News DBS Share Price, Dividends & News OCBC Share Price, Dividends & News Great Eastern Share Price, Dividends & News Citi, Citigroup Share Price, Dividends & News Malaysian Ringgit Rates & News Japanese Yen Rates & News US Dollar Rates & News View More Sembcorp Share Price News Seatrium Share Price News Sheng Siong Share Price News 99 Group Share Price News CapitaLand Share Price News ST Engineering Share Price News Singtel Share Price News SIA Singapore Airlines Share Price News Keppel Corp Share Price News Genting Singapore Share Price News View More CPF Central Provident Fund News MAS Monetary Authority of Singapore News Inland Revenue Authority of Singapore News MOF Ministry of Finance Singapore News Singapore Budget News Singapore Elections News Singapore Manufacturing News Singapore Inflation Rate News GST Goods & Services Tax News CDC Vouchers News View More Keppel Pacific Oak US REIT News Keppel DC REIT News Capitaland Integrated Commercial Trust CICT REIT News Mapletree Industrial Trust REIT News Capitaland Ascendas REIT News Digital Core REIT News Frasers Logistics & Commercial Trust REIT News Mapletree Logistics Trust REIT News Mapletree Pan Asia Commercial Trust REIT News Frasers Centrepoint Trust REIT News View More Singapore ABSD News Singapore Rental Market News GCB Good Class Bungalow News SLA Singapore Land Authority News CDL City Developments Limited News ",
    "credibility": 0.6,
    "observed_at": "2025-12-13T23:04:10Z",
    "region": "context",
    "domain": "general",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-13T23:04:10Z",
      "numeric": true,
      "depth": 0.85,
      "sample_size": "",
      "rescued_from": "https://www.reuters.com/world/us/us-economic-activity-little-changed-ahead-next-fed-meeting-beige-book-report-2025-11-26/",
      "rescue_title": "US economic activity little changed ahead of next Fed meeting, report shows"
    },
    "authority": 0.6,
    "recency": 0.9285714285714286,
    "us_fit": 0.6333333333333333,
    "quality": 0.714,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 4,
    "title": "Daily Search Forum Recap: December 11, 2025",
    "url": "https://www.seroundtable.com/recap-12-11-2025-40584.html",
    "publisher": "seroundtable.com",
    "date": "2025-12-11",
    "snippet": "Daily Search Forum Recap: December 11, 2025 Google Bing Algorithm Updates Maps Ads Search Subscribe More Menu The Pulse of the search community Follow Subscribe Subscribe Options Browse By Browse by Date Find by Category Discover by Author Scan Most Recent See Comments View Tag C",
    "content": "Daily Search Forum Recap: December 11, 2025 Google Bing Algorithm Updates Maps Ads Search Subscribe More Menu The Pulse of the search community Follow Subscribe Subscribe Options Browse By Browse by Date Find by Category Discover by Author Scan Most Recent See Comments View Tag Cloud Light / Dark Mode Settings Light Dark Use Device Settings Advertise Contact Us Home / Search Forum Recap / Daily Search Forum Recap: December 11, 2025 Daily Search Forum Recap: December 11, 2025 Dec 11, 2025 - 10:00 am 0 — by Barry Schwartz Barry Schwartz / Executive Editor Barry Schwartz is the CEO of RustyBrick and a technologist, a New York Web service firm specializing in customized online technology that helps companies decrease costs and increase sales. Barry is also the founder of the Search Engine Roundtable and the News Editor of Search Engine Land . He is well known & respected for his expertise in the search marketing industry. He only provides consulting services to expert SEOs and also performs search marketing expert witness services. Barry graduated from the City University of New York and lives with his family in the NYC region. You can follow Barry on Twitter at @rustybrick or on LinkedIn and read his full bio over here . 37,723 Articles as barry.schwartz Filed Under Search Forum Recap Here is a recap of what happened in the search forums today, through the eyes of the Search Engine Roundtable and other search forums on the web. Google is rolling out updated and more clickable links in AI Mode and new contextual introductions. Google's preferred sources are now available globally, plus there are new spotlighting subscriptions in Gemini and soon to come to AI Mode and AI Overviews. Google Web Guide is now available in the all tab, officially but it is still a beta. Microsoft Advertising is testing grouping its sponsored search results with the hide/show button, like Google Ads launched two months ago. Google AdSense now has Offerwall optimization. Search Engine Roundtable Stories: Google AI Mode Links Updated & Adds Contextual Introductions Google announced it has updated the links in AI Mode to encourage searchers to click more. Google also introduced contextual introductions to embedded links in AI Mode responses. Google Preferred Sources Now Global & Adds Spotlighting Subscriptions Google announced that Preferred Sources is now rolling out globally, after launching just in the US and India in August, following its beta period in June. Plus, Google announced Spotlighting subscriptions are coming to Gemini, AI Mode, and AI Overviews. Google has updated the Google Business Profiles verification issues support form. Google Web Guide Expands To All Tab Officially (Opt In Still Needed) Google has officially expanded the Web Guide to the \"All\" tab. Originally, when it launched as a Search Labs beta, it was under the \"Web\" tab, but as we saw, Google began expanding it to the \"All\" tab. Bing Tests Hide Sponsored Results Button & Ad Grouping, Like Google Ads Microsoft is testing out the new Google Ads sponsored results label, ad grouping and hide button with its own Bing Search results ads. Microsoft Advertising search ads in Bing are testing grouping multiple search ads under one \"Sponsored results\" label, and then at the bottom, there is a \"Hide\" and then \"Show\" button. Google AdSense Offerwall Optimization: Automatic Enrollment In June, Google moved Offerwall out of its AdSense beta, making it available to all. Now, if you are using Offerwall, Google will opt you into Offerwall optimization. Google Sleep Nets At Zurich Office Google has these sleeping bed nets, hammock-like, at the Zurich office. This way, the Googlers can sleep on the job. We know Google loves its sleeping and resting areas. Other Great Search Threads: Gemini in November 2025: - 1.351 billion visits - #26 website in the world (+4 spots from October) , Similarweb on X Google: they don’t think is true that GEO can be done without SEO. They don’t think there’s GEO withou",
    "credibility": 0.6,
    "observed_at": "2025-12-13T23:04:41Z",
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-13T23:04:41Z",
      "numeric": true,
      "depth": 0.85,
      "sample_size": "",
      "rescued_from": "https://searchengineland.com/how-to-evaluate-your-seo-tools-in-2026-and-avoid-budget-traps-465783",
      "rescue_title": "How to evaluate your SEO tools in 2026 – and avoid budget traps"
    },
    "authority": 0.6,
    "recency": 0.8571428571428572,
    "us_fit": 0.6333333333333333,
    "quality": 0.696,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 5,
    "title": "The Personal Touch: How Small Businesses Can Win This Christmas Through Connection",
    "url": "https://www.forbes.com/councils/forbescommunicationscouncil/2025/12/04/the-personal-touch-how-small-businesses-can-win-this-christmas-through-connection/",
    "publisher": "forbes.com",
    "date": "2025-12-04",
    "snippet": "How Small Businesses Can Win This Christmas Through Connection Newsletters Games Share a News Tip Featured Featured Breaking News White House Watch Daily Cover Stories Forbes 2026 Top Hospitals List Formula 1’s Highest-Paid Drivers 2025 Americans Want To Recycle More – But Aren’t",
    "content": "How Small Businesses Can Win This Christmas Through Connection Newsletters Games Share a News Tip Featured Featured Breaking News White House Watch Daily Cover Stories Forbes 2026 Top Hospitals List Formula 1’s Highest-Paid Drivers 2025 Americans Want To Recycle More – But Aren’t. Here’s How To Turn Good Intentions Into Action | Paid Program How Innovation Can Streamline Expense Management And B2B Transactions | Paid Program Celebrating Top Fundraisers Uniting To End Blood Cancers | Paid Program America's 2025 Top Wealth Management Teams Private Wealth List The Forbes CIO Next List: 2025 | Paid Program America's 2025 Top Wealth Management Teams High Net Worth List When Teens Fundraise To End Blood Cancer, They Change Lives, Including Their Own | Paid Program The Employee Well-Being Imperative | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Next Billion-Dollar Startups 2025 Four Reasons To Rethink Your Savings Strategy America's Most Powerful Women In Sports Navigating Retirement In Today’s Economic Landscape Forbes Iconoclast: How Top Investors Find Opportunities In Times Of Uncertainty The Joy Of Checking Out The Performance Layer | Paid Program Do You Know The True Cost Of Your Legacy Finance Tech? Take This Quiz To Find Out | Paid Program CXO Spotlight | Paid Program Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All AI-Powered Cybersecurity Employee and Customer Experience The New Brand Growth Formula: A Data-Driven Culture Fueled By AI | Paid Program Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Dell Technologies BrandVoice | Paid Program Money Money See All ETF Investing Trends Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Luxury Travel Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobb",
    "credibility": 0.65,
    "observed_at": "2025-12-13T23:04:50Z",
    "region": "US",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-13T23:04:50Z",
      "numeric": true,
      "depth": 0.85,
      "sample_size": ""
    },
    "authority": 0.65,
    "recency": 0.3571428571428571,
    "us_fit": 0.9666666666666666,
    "quality": 0.66,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 6,
    "title": "How might private equity’s deal with the University of Utah turn gold? How might it turn sour?",
    "url": "https://www.sltrib.com/sports/utah-utes/2025/12/10/what-utahs-new-private-equity-deal/",
    "publisher": "sltrib.com",
    "date": "2025-12-11",
    "snippet": "What Utah’s new private equity deal means for the future of Utes athletics How might private equity’s deal with the University of Utah turn gold? How might it turn sour? Breaking down what Utah’s new private equity deal means for the future of Utes athletics. (Francisco Kjolseth ",
    "content": "What Utah’s new private equity deal means for the future of Utes athletics How might private equity’s deal with the University of Utah turn gold? How might it turn sour? Breaking down what Utah’s new private equity deal means for the future of Utes athletics. (Francisco Kjolseth | The Salt Lake Tribune) University of Utah Athletic Director Mark Harlan helps introduce former Ute player Alex Jensen as new head coach of the Utah men’s basketball team at the Huntsman Center on Monday, March 17, 2025. A new era of University of Utah athletics was announced Tuesday. Understandably, there’s a lot of confusion about it. As you’ve probably heard by now, the Utes are entering into an agreement with Otro Capital to create a spinoff, for-profit company that runs the business of Utah sports. But what does that mean exactly? Who is this Otro Capital? And how might this deal turn out well or turn out poorly down the road? What just happened? On Tuesday, the University of Utah announced its intention to form a for-profit company called Utah Brands & Entertainment that does much of what its athletic department currently does, especially with regards to the making of money. That means Utah Brands & Entertainment will control ticketing, sponsorships, events, and so forth. That’s not particularly novel in the landscape of college athletics; Kentucky, Clemson, West Virginia, Michigan State, and Texas Tech have done the same. But what is new is that the Utes are inviting a private equity fund , Otro Capital, to join the business as a partner. Utah is the first major collegiate sports program to do that. In the deal, Otro Capital will provide both immediate and ongoing financial support to the currently cash-strapped Utes sports program to the tune of hundreds of millions of dollars. Specific figures weren’t announced by the school, but Yahoo! Sports reported the deal is “expected to generate as much or more than $500 million in capital.” Otro will have a large share, but not a majority share, in Utah Brands & Entertainment in return. What is Otro Capital? They’re a private equity fund specializing in sports entities founded in 2023. Currently, their portfolio of investments boasts just three names: • Alpine Racing, the Formula 1 team that finished at the bottom of the Constructors’ Championship this year. (Geert Vanden Wijngaert | AP) Alpine driver Pierre Gasly of France steers his car during the first practice session ahead of the Formula One Grand Prix at the Spa-Francorchamps racetrack in Spa, Belgium, on July 28, 2023. • FlexWork Sports, a company that helps college and professional athletes around the country run youth sports camps. • Two Circles, a data-driven sports marketing firm that has worked with the NFL, the Olympics, the English Premier League, Wimbledon, and others. Despite the short list and short existence, Otro has more experience than it might seem in this game. Their co-founders Alec Scheiner, Brent Stehlik, Niraj Shah, and Isaac Halyard all were former executives at RedBird Capital Partners, founded in 2014. That company is one of the largest names in sports private equity, with stakes in AC Milan, Toulouse, Fenway Sports, and even ownership of the XFL’s rights. Of those four founders, Scheiner has the most notable career so far. He was president of the Cleveland Browns from 2012-16 before he left and joined RedBird. Otro had $839,430,865 in assets under management in their latest SEC filing. Do these companies or these investors have ties to Utah? The University of Utah didn’t highlight any ties in its proceedings on Tuesday. Yahoo! reported that Otro pitched this collegiate plan to other schools in the country, including at least one in the Big Ten Conference, before Utah showed interest. However, there are some second-level ties. For example, the Huntsman Family’s investment arm purchased a stake in Alpine Racing at the same time Otro did. Former Utah Jazz president Dave Checketts was CEO of Legends Hospitality, a concession",
    "credibility": 0.6,
    "observed_at": "2025-12-13T23:04:51Z",
    "region": "context",
    "domain": "general",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-13T23:04:51Z",
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 0.8571428571428572,
    "us_fit": 0.0,
    "quality": 0.529,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 7,
    "title": "How Local Can Dominate Against The Giants",
    "url": "https://www.forbes.com/councils/forbesbusinesscouncil/2025/12/05/how-local-can-dominate-against-the-giants/",
    "publisher": "forbes.com",
    "date": "2025-12-05",
    "snippet": "How Local Can Dominate Against The Giants Newsletters Games Share a News Tip Featured Featured Breaking News White House Watch Daily Cover Stories Forbes 2026 Top Hospitals List Formula 1’s Highest-Paid Drivers 2025 Americans Want To Recycle More – But Aren’t. Here’s How To Turn ",
    "content": "How Local Can Dominate Against The Giants Newsletters Games Share a News Tip Featured Featured Breaking News White House Watch Daily Cover Stories Forbes 2026 Top Hospitals List Formula 1’s Highest-Paid Drivers 2025 Americans Want To Recycle More – But Aren’t. Here’s How To Turn Good Intentions Into Action | Paid Program How Innovation Can Streamline Expense Management And B2B Transactions | Paid Program Celebrating Top Fundraisers Uniting To End Blood Cancers | Paid Program America's 2025 Top Wealth Management Teams Private Wealth List The Forbes CIO Next List: 2025 | Paid Program America's 2025 Top Wealth Management Teams High Net Worth List When Teens Fundraise To End Blood Cancer, They Change Lives, Including Their Own | Paid Program The Employee Well-Being Imperative | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Next Billion-Dollar Startups 2025 Four Reasons To Rethink Your Savings Strategy America's Most Powerful Women In Sports Navigating Retirement In Today’s Economic Landscape Forbes Iconoclast: How Top Investors Find Opportunities In Times Of Uncertainty The Joy Of Checking Out The Performance Layer | Paid Program Do You Know The True Cost Of Your Legacy Finance Tech? Take This Quiz To Find Out | Paid Program CXO Spotlight | Paid Program Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All AI-Powered Cybersecurity Employee and Customer Experience The New Brand Growth Formula: A Data-Driven Culture Fueled By AI | Paid Program Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Dell Technologies BrandVoice | Paid Program Money Money See All ETF Investing Trends Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Luxury Travel Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitch",
    "credibility": 0.65,
    "observed_at": "2025-12-13T23:04:53Z",
    "region": "US",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-13T23:04:53Z",
      "numeric": true,
      "depth": 0.85,
      "sample_size": ""
    },
    "authority": 0.65,
    "recency": 0.4285714285714286,
    "us_fit": 0.9666666666666666,
    "quality": 0.678,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 8,
    "title": "How Tariffs and Technology Reshaped the U.S. Economy in 2025",
    "url": "https://www.pimco.com/us/en/insights/how-tariffs-and-technology-reshaped-the-us-economy-in-2025-and-what-comes-next",
    "publisher": "pimco.com",
    "date": "unknown",
    "snippet": "How Tariffs and Technology Reshaped the U.S. Economy in 2025 – and What Comes Next | PIMCO Skip to Main Content United States Log In PIMCO.com Log In Not a member? Register Account Primary navigation Investments Investments Click here to return to the Main Menu Products Mutual Fu",
    "content": "How Tariffs and Technology Reshaped the U.S. Economy in 2025 – and What Comes Next | PIMCO Skip to Main Content United States Log In PIMCO.com Log In Not a member? Register Account Primary navigation Investments Investments Click here to return to the Main Menu Products Mutual Funds ETFs Interval Funds Closed-End Funds View All Products View From the Investment Committee Making Sense of Private Markets: Liquidity, Risk and Opportunity Dan Ivascyn discusses the growing complexity in credit markets and how to navigate it. Insights Insights Click here to return to the Main Menu Latest Insights Economic and Market Commentary Investment Strategies Research View All OUTLOOKS Secular Outlook Cyclical Outlook Economic and Market Commentary Charting the Year Ahead: Investment Ideas for 2026 Marc Seidner, CIO of Non-traditional Strategies, explores opportunities across equities, bonds, credit, and commodities that have the potential to offer investors resilience and diversification. About Us About Us Click here to return to the Main Menu Who We Are About Us Our Process Firm Leadership Our Purpose & Impact Inclusion & Diversity Purpose at PIMCO More Contact Us PIMCO Offices Press Releases Media Contacts Careers United States Log In PIMCO.com Log In Not a member? Register Account Search our website Recent Search Close (Press escape to close) Macro Signposts How Tariffs and Technology Reshaped the U.S. Economy in 2025 – and What Comes Next Macro Signposts highlights takeaways from the data analysis conducted by our team of economists and other experts. Open Table of Contents. Current section: How Tariffs and Technology Reshaped the U.S. Economy in 2025 – and What Comes Next Share Share via Email Share via Linkedin Share via Twitter Print Tiffany Wilding 12/4/2025 | {read_time} min read Share Share via Email Share via Linkedin Share via Twitter Print PIMCO Pod How Tariffs and Technology Reshaped the U.S. Economy in 2025 – and What Comes Next Play Pause 0:00 / 11:44 Seek Volume Volume 1x Playback Speed 2x 1.75x 1.5x 1.25x 1x 0.75x More Modules-Podcast-SubscribeOn Spotify Apple Podcasts Close The U.S. economy has been surprisingly resilient in 2025. Growth held up well as policy-related pressures had offsetting impacts: Many companies accelerated artificial intelligence (AI) deployment and investment while reassessing or consolidating labor forces, mainly in an effort to manage tariff-related costs. In 2026, a reasonable baseline outlook is that the U.S. economy will get fresh support from the One Big Beautiful Bill Act’s front-loaded fiscal easing, which should help to broaden growth and stabilize the labor market. Nevertheless, there are risks. Tariff, tax, and trade policies along with a new technology investment wave are creating winners and losers across the economy. The push and pull between these groups, and the potential fits and starts in investment cycles, could have implications either way. Shifting personnel at the Federal Reserve creates additional uncertainty. We will be discussing these issues and more at our upcoming Cyclical Forum – when PIMCO’s investment professionals gather to discuss the outlook for the global economy and markets along with investment implications. Before we discuss these forward-looking issues, it’s important to think about how things have progressed in 2025, and where the surprises have been. The story of 2025: Tariff and tax policy accelerated AI deployment U.S. real GDP growth was surprisingly resilient in 2025 amid the Trump administration’s fiscal, trade, and immigration policy changes. We await further economic data releases (delayed by the government shutdown), and for now we estimate real U.S. GDP grew between 1.5%–2.0% in 2025. That’s down from the 2.5%–3.0% pace in 2024, according to the Bureau of Economic Analysis (BEA), but much better than many expected. Similarly, core U.S. inflation remained elevated at 3% (according to the Bureau of Labor Statistics (BLS)), but was also more benign than m",
    "credibility": 0.6,
    "observed_at": "2025-12-13T23:04:56Z",
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-13T23:04:56Z",
      "numeric": true,
      "depth": 0.85,
      "sample_size": "",
      "rescued_from": "https://seekingalpha.com/article/4850567-how-tariffs-technology-reshaped-us-economy-in-2025-what-comes-next",
      "rescue_title": "How Tariffs And Technology Reshaped The U.S. Economy In 2025 And What Comes Next"
    },
    "authority": 0.6,
    "recency": 0.8,
    "us_fit": 0.6666666666666666,
    "quality": 0.688,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 9,
    "title": "Microsoft Industry Blogs: Retail",
    "url": "https://www.microsoft.com/en-us/industry/blog/retail/",
    "publisher": "microsoft.com",
    "date": "2025-12-01",
    "snippet": "Your request has been blocked. This could be due to several reasons. Skip to main content Microsoft Microsoft 365 Teams Copilot Windows Surface Xbox Deals Small Business Support More All Microsoft Office Windows Surface Xbox Deals Support Software Windows Apps OneDrive Outlook Sk",
    "content": "Your request has been blocked. This could be due to several reasons. Skip to main content Microsoft Microsoft 365 Teams Copilot Windows Surface Xbox Deals Small Business Support More All Microsoft Office Windows Surface Xbox Deals Support Software Windows Apps OneDrive Outlook Skype OneNote Microsoft Teams Microsoft Edge PCs & Devices Computers Shop Xbox Accessories VR & mixed reality Phones Entertainment Xbox Game Pass Ultimate Xbox Live Gold Xbox games PC games Windows digital games Movies & TV Business Microsoft Azure Microsoft Dynamics 365 Microsoft 365 Microsoft Industry Data platform Microsoft Advertising Licensing Shop Business Developer & IT .NET Visual Studio Windows Server Windows Dev Center Docs Other Microsoft Rewards Free downloads & security Education Store locations Gift cards View Sitemap Search Search Microsoft.com Cancel Your current User-Agent string appears to be from an automated process, if this is incorrect, please click this link: United States English Microsoft Homepage What's new Surface Laptop Studio 2 Surface Laptop Go 3 Surface Pro 9 Surface Laptop 5 Microsoft Copilot Copilot in Windows Microsoft 365 Windows 11 apps Microsoft Store Account profile Download Center Microsoft Store support Returns Order tracking Certified Refurbished Microsoft Store Promise Flexible Payments Education Microsoft in education Devices for education Microsoft Teams for Education Microsoft 365 Education How to buy for your school Educator training and development Deals for students and parents Azure for students Business Microsoft Cloud Microsoft Security Dynamics 365 Microsoft 365 Microsoft Power Platform Microsoft Teams Copilot for Microsoft 365 Small Business Developer & IT Azure Developer Center Documentation Microsoft Learn Microsoft Tech Community Azure Marketplace AppSource Visual Studio Company Careers About Microsoft Company news Privacy at Microsoft Investors Diversity and inclusion Accessibility Sustainability English (United States) Sitemap Contact Microsoft Privacy Terms of use Trademarks Safety & eco Recycling About our ads Â© Microsoft 2024.303",
    "credibility": 0.6,
    "observed_at": "2025-12-13T23:05:04Z",
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-13T23:05:04Z",
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 0.1428571428571429,
    "us_fit": 0.6333333333333333,
    "quality": 0.477,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  }
]