[
  {
    "id": 1,
    "title": "One More Dollar brings its energy to Finke Theatre",
    "url": "https://www.newstribune.com/news/2025/nov/13/one-more-dollar-brings-its-energy-to-finke-theatre/",
    "publisher": "newstribune.com",
    "date": "2025-12-02",
    "snippet": "Get ready to clap your hands and stomp your feet, as good old-fashioned \"Ozarkana\" is coming to the Finke Theatre. One Dollar More, a band specializing in an energetic fusion of bluegrass, folk and more, will perform Saturday at the theater at 315 N.",
    "content": "One More Dollar brings its energy to Finke Theatre | Jefferson City News Tribune Subscribe Sign In Manage Subscription Sign Out Today's Paper News Sports Newsletters Obituaries Things to do Puzzles Classifieds Contact Us One More Dollar brings its energy to Finke Theatre November 13, 2025 by Kaden Quinn Courtesy/One More Dollar website From left, musicians Robert Adkison, Jeremy Myers and Alisha Thomas form the band One More Dollar. The trio will play at 7 p.m. Saturday at the Finke Theater in California. Get ready to clap your hands and stomp your feet, as good old-fashioned \"Ozarkana\" is coming to the Finke Theatre. One Dollar More, a band specializing in an energetic fusion of bluegrass, folk and more, will perform Saturday at the theater at 315 N. Subscribe to continue reading, or log in . Kaden Quinn [email protected] Kaden Quinn is the editor of the California Democrat. He is a resident of Jefferson City and a graduate of Lincoln University where he received a bachelor’s degree in journalism with a minor in English. Kaden has worked for various publications while in high school and college. His internship with the Jefferson City News Tribune led him to his current home, the California Democrat. Quinn began his career with the Democrat in May 2021 as a reporter and became the interim editor in January 2022. Three months later he was officially named editor. He enjoys covering the California and Moniteau community, reporting on a wide variety of stories, from county news to school updates and business openings. His goal as the editor is to always present information fairly and accurately. Comments Popular Stories Upcoming Events Featured Local Savings Featured Local Savings About Us Contact Us Subscribe Advertise Terms of Use Commercial Printing Ethics Policy Privacy Preferences News Local News Missouri News Obituaries Nation World Business Politics Elections Digital Replica Podcasts Archives Lifestyle Entertainment Flavor Style Health GoMidMo Weddings and Anniversaries Jefferson City Landmarks Events Submit an Event Readers' Choice Awards Puzzles Extras Classifieds Legals Jobs NT Contests NT Rewards Contact Us Publications Fulton Sun California Democrat Newsletters Sports High School College Pro KC Chiefs Opinion All Opinion Editorials Letters to the Editor Submit Letters to Editor Copyright © 2025, News Tribune Publishing All rights reserved. This document may not be reprinted without the express written permission of News Tribune Publishing Material from the Associated Press is Copyright © 2025, Associated Press and may not be published, broadcast, rewritten, or redistributed. Associated Press text, photo, graphic, audio and/or video material shall not be published, broadcast, rewritten for broadcast or publication or redistributed directly or indirectly in any medium. Neither these AP materials nor any portion thereof may be stored in a computer except for personal and noncommercial use. The AP will not be held liable for any delays, inaccuracies, errors or omissions therefrom or in the transmission or delivery of all or any part thereof or for any damages arising from any of the foregoing. All rights reserved. × Subscribe Sign in Manage Account Sign Out 34° Fair News Local News Missouri News Obituaries Nation World Business Politics Elections Digital Replica Podcasts Archives Sports High School College Pro KC Chiefs Opinion All Opinion Editorials Letters to the Editor Submit Letters to the Editor Lifestyle Entertainment Flavor Style Health GoMidMo Weddings and Anniversaries Jefferson City Landmarks Events Submit an event Readers Choice Awards Publications Fulton Sun California Democrat Newsletters Extras Classifieds Legal Notices Jobs NT Contests NT Rewards Contact Us",
    "credibility": 0.6,
    "region": "context",
    "domain": "general",
    "source_type": "analysis",
    "evidence": {
      "numeric": true,
      "depth": 0.85,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.732,
    "role": "support",
    "source_grade": "C",
    "tier": "core"
  },
  {
    "id": 2,
    "title": "Why young real estate agents are rethinking brokerage loyalty now",
    "url": "https://www.housingwire.com/articles/real-estate-agent-loyalty-survey-2025/",
    "publisher": "housingwire.com",
    "date": "2025-12-02",
    "snippet": "When broker-owner Lisa Tran looked around her office this summer, she noticed something unsettling. Her younger agents — talented, ambitious, tech-forward — were asking questions that hinted at more than curiosity. Tran isn’t alone. The ground under ...",
    "content": "Real estate agents show conditional loyalty to brokerages Skip to content News Latest News Housing Market Mortgage Mortgage Rates Homebuilding Reverse Real Estate Agents Brokerage Technology Title Vetted Events The Gathering AI Summit Mortgage Banking Summit Housing Economic Summit Focus On Excellence Webinars Demo Day Video Altos RealTrends HW Data More + Sign In Subscribe Your Account Manage Feed Subscription Options Newsletters Gift HousingWire Podcasts Company Search Logout Inventory 817,297 13,148 30-yr Fixed Rate 30-yr Fixed 6.36% 0.00% 10Y Treasury 4.02% 4.02% Youtube Facebook Instagram Twitter LinkedIn 30-Yr. Fixed Conforming. Updated hourly during market hours. Single family homes on the market. Updated weekly. Powered by Altos Research Market yield on U.S. treasury securities at 10-year constant maturity. Updated daily. Data sourced from FRED Subscribe Sign In Welcome, + Your Account Manage Feed Subscription Options Newsletters Gift HousingWire Podcasts Company Search Logout News + Latest News Housing Market Mortgage Mortgage Rates Homebuilding Reverse Real Estate Agent Brokerage Technology Title Vetted by HW Events + The Gathering AI Summit Mortgage Banking Summit Housing Economic Summit Focus On Excellence Webinars Demo Day Video Altos RealTrends HW Data Awards Podcasts Research White Papers Product Guides Marketing Services HW Media Youtube Facebook Instagram Twitter LinkedIn Agent | Brokerage | Real Estate 4 minute read Why young real estate agents are rethinking brokerage loyalty now New 1000WATT research reveals what’s driving agent loyalty and why the next generation is ready to walk. November 6, 2025, 1:14pm by Tracey Velt News > Real Estate Article Summary A survey of 600 real estate agents shows younger agents are more open to switching brokerages. Culture, clear vision, and training drive loyalty more than pay or technology. AI Summary When broker-owner Lisa Tran looked around her office this summer, she noticed something unsettling. Her younger agents — talented, ambitious, tech-forward — were asking questions that hinted at more than curiosity. “What’s it like at [insert competitor name here]?” “Do you think I’d fit in at a virtual brokerage?” Tran isn’t alone. The ground under brokerages is quaking. Between commission lawsuits , shifting economics and mega mergers, agents are reassessing what they want — and what they’ll tolerate. To find out where their heads really are, 1000WATT surveyed 600 real estate professionals across the U.S. this fall. The findings paint a nuanced portrait of an industry in flux: loyalty isn’t gone, but it’s conditional. Young agents are restless Half of all respondents said they’re about as open to switching brokerages as they were last year. But 31% are more open — and among agents under 35, that number jumps to 53%. That generational divide is a flashing warning light. Veteran agents tend to prize stability and community; their younger peers are searching for momentum and growth. The fix isn’t one-size-fits-all. The data suggests that brokerages need a “career-stage loyalty plan”—clear progression paths, evolving incentives, and mentorship that converts curiosity into commitment. In other words, design the road so ambitious agents don’t have to look for the next exit. Brokerage vision doubles happiness Culture and comp matter, but nothing beats clarity. Eighty-seven percent of agents who say their brokerage has a ‘clear vision for the future’ also report being happy where they are. Among those who don’t see a vision, less than half feel that way. Agents aren’t just asking for lofty mission statements — they want to see direction reflected in decisions. The happiest ones see their brokerage’s vision come to life in tangible ways: in training programs, leadership communication and consistent follow-through. For recruiters, that’s gold. A strong, lived vision isn’t just an internal morale booster; it’s an external magnet for top performers. Tech drives affiliation—but not depa",
    "credibility": 0.6,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.692,
    "role": "support",
    "source_grade": "C",
    "tier": "core"
  },
  {
    "id": 3,
    "title": "JPMorgan employs 120 at digital retail bank in Germany, to grow over time",
    "url": "https://www.reuters.com/business/finance/jpmorgan-employs-120-digital-retail-bank-germany-grow-over-time-2025-11-11/",
    "publisher": "reuters.com",
    "date": "2025-12-02",
    "snippet": "FRANKFURT, Nov 11 (Reuters) - JPMorgan (JPM.N), opens new tab has moved 120 employees for its upcoming digital retail bank into its new central Berlin headquarters and expects to hire more people in the years to come in a building with space for 400.",
    "content": "FRANKFURT, Nov 11 (Reuters) - JPMorgan (JPM.N), opens new tab has moved 120 employees for its upcoming digital retail bank into its new central Berlin headquarters and expects to hire more people in the years to come in a building with space for 400.",
    "credibility": 0.95,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.95,
    "recency": 1.0,
    "us_fit": 0.0,
    "quality": 0.723,
    "role": "support",
    "source_grade": "A",
    "tier": "core"
  },
  {
    "id": 4,
    "title": "Billion-dollar beverage company touts 'fun' new drink collaboration with young TikTok star",
    "url": "https://www.foxbusiness.com/media/billion-dollar-beverage-company-touts-fun-new-drink-collab-young-tiktok-star",
    "publisher": "foxbusiness.com",
    "date": "2025-12-02",
    "snippet": "AriZona Beverages founder Don Vultaggio touted the company’s newest drink collaboration with a young TikTok star as being more successful than its inimitable Arnold Palmer on \"The Claman Countdown\" Thursday. \"We’ve teamed up with a 9-year-old, and we ...",
    "content": "AriZona beverages touts new drink collab with young TikTok star 'The Rizzler' | Fox Business Fox Business Personal Finance Mortgages Student Loans Credit Cards Personal Loans Savings Insurance 401k Retirement Tax Planning Economy Government Spending Money & Policy Small Business Markets Stocks US Markets Cryptocurrency Futures & Commodities Bonds ETFs Business Leaders Industries Retail Pre-Markets Mutual Funds Watchlist Lifestyle Entertainment Rich & Famous Travel Cars Airplanes Food & Drinks Arts Real Estate Personal Real Estate Commercial Real Estate Luxury Properties Tech Digital Social Media Gadgets Business Tech Healthcare Tech Future Tech AI Space Video Podcasts More Expand / Collapse search Login Watch TV ☰ Sports NFL NBA MLB NASCAR Boxing Soccer Golf Tennis Opinion Watch Live Fox Business Shows Programming Schedule On Air Personalities Full Episodes Show Clips News Clips About Channel Finder Jobs Terms of Use Privacy Policy FAQ Media Relations Corporate Information Closed Captioning Policy Accessibility Statement Fox News Fox Nation Fox Business Go Apps & Products Facebook Twitter Instagram YouTube Flipboard LinkedIn RSS Newsletter Spotify iHeartRadio Fox Business Terms of Use Privacy Policy Your Privacy Choices Help Closed Captioning Policy Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided by Factset . Powered and implemented by FactSet Digital Solutions . Legal Statement . This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX News Network, LLC. All rights reserved. FAQ - New Privacy Policy Recommended Videos Left Arrow Top business leaders say catering to South Florida demand proves 'very successful' Credit expert reveals ‘the biggest thing’ to know about new mortgage loan models Cracker Barrel CEO on being 'fired by America' after redesign fiasco Americans at risk of ‘being completely and totally underwater’ with 50-year mortgage: Credit expert Former US Army captain ridicules Dems in military video: He has 'sold his soul' to political power Palm Beach-area ‘trophy property' hits the market next door to Larry Ellison Larry Kudlow: I'm not buying this, and you shouldn't either Charles Payne: These words are 'music to the ears' of investors Stuart Varney: BBC can’t be allowed to keep peddling unquestioned liberalism Republicans are 'missing the vote' on this message, argues communications strategist NY AG Letitia James scolds Condé Nast over ‘Fired Four,’ threatens court Podcast host says this 'new part' of Dem Party 'terrifies' him most GOP congressman argues 'real reason' Schumer shut down the government Charles Payne: This is a nation of 'haves and have-nots' US veterans entering civilian workforce ‘thrive’ on career adaptability Charles Payne reveals names investors are 'placing their bets and their hopes' on Binance founder Changpeng Zhao admits he was surprised by Trump pardon, denies having ties to Trump family Palantir CEO questions why 'newspapers are helping Mamdani win' and lack honest discussions about our future NYC election anxiety spurs $100M+ for Florida developer from ‘nervous’ New Yorkers Trump says Dems 'just don't know what they're doing,' have become 'crazed lunatics' Right Arrow Media Published November 13, 2025 7:12pm EST Billion-dollar beverage company touts 'fun' new drink collaboration with young TikTok star AriZona Beverages teamed up with 9-year-old TikTok star Christian 'The Rizzler' Savasta for its latest fizzy drink Facebook Twitter Comments Print Email Add Fox Business on Google By Stephanie Samsel FOXBusiness close video AriZona Beverages founder talks new collab with young TikTok star TikTok star Christian 'The Rizzler' Savasta and AriZona beverages founder Don Vultaggio explain how their new drink collaboration began as an April Fools' joke and more on 'The Claman Countdown.' AriZona Beverages founder Don Vultaggio touted the company’s newest drink collaboration with a young TikTok star as being more successful than ",
    "credibility": 0.6,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.692,
    "role": "support",
    "source_grade": "C",
    "tier": "core"
  },
  {
    "id": 5,
    "title": "C-stores Redefine & Elevate Their Loyalty Programs",
    "url": "https://csnews.com/c-stores-redefine-elevate-their-loyalty-programs",
    "publisher": "csnews.com",
    "date": "2025-12-02",
    "snippet": "Brands like Nittany MinitMart, Quality Oil and Weigel's are moving beyond a one-size-fits-all approach. Earlier this year, Quality Oil Co., which owns and operates three convenience retail brands, partnered with Newtown, Mass.-based Paytronix, a cloud ...",
    "content": "Brands like Nittany MinitMart, Quality Oil and Weigel's are moving beyond a one-size-fits-all approach. Earlier this year, Quality Oil Co., which owns and operates three convenience retail brands, partnered with Newtown, Mass.-based Paytronix, a cloud ...",
    "credibility": 0.6,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.0,
    "quality": 0.565,
    "role": "support",
    "source_grade": "C",
    "tier": "core"
  },
  {
    "id": 6,
    "title": "Dear Annie: I’ve always lived in my sister’s shadow. Am I chasing approval I’ll never get?",
    "url": "https://www.oregonlive.com/advice/2025/11/dear-annie-ive-always-lived-in-my-sisters-shadow-am-i-chasing-approval-ill-never-get.html",
    "publisher": "oregonlive.com",
    "date": "2025-12-02",
    "snippet": "Dear Annie: I’ve always had a complicated relationship with my older sister, “Beth.” She’s the golden child -- successful, pretty, everyone’s favorite. I’m more of the quiet one. I’ve never resented her accomplishments, but I’ve spent years ...",
    "content": "Dear Annie: I’ve always lived in my sister’s shadow. Am I chasing approval I’ll never get? - oregonlive.com Skip to Article Set weather Back To Main Menu Close Quick Look - Change your current location » Current - Mostly Sunny Tonight Low - Mostly Sunny Tomorrow High - Mostly Sunny View full weather report Cyber Sale is ON! $20 for 6 months. Lowest price of the year. Advice Dear Annie: I’ve always lived in my sister’s shadow. Am I chasing approval I’ll never get? Published: Nov. 13, 2025, 4:30 p.m. Part of me wants to let it go and focus on the win. But another part of me feels really, really sad, like I’m still chasing approval I’ll never get. pressmaster - stock.adobe.com By Annie Lane Dear Annie: I’ve always had a complicated relationship with my older sister, “Beth.” She’s the golden child -- successful, pretty, everyone’s favorite. I’m more of the quiet one. I’ve never resented her accomplishments, but I’ve spent years feeling like I’m living in her shadow. Recently, something strange happened. I got offered a promotion at work that would put me in a leadership role over a project Beth’s company is contracted on. It’s a huge opportunity. When I told my parents, they were polite but not enthusiastic. My mom actually said, “Well, let’s hope that doesn’t make things awkward for Beth.” Beth hasn’t said much, just a text that said “Congrats,” with a period. Not even an exclamation point. Part of me wants to let it go and focus on the win. But another part of me feels really, really sad, like I’m still chasing approval I’ll never get. I don’t want this old family dynamic to steal the joy from something I worked hard for. How do I celebrate myself without needing my family to do it with me? And is it worth trying to fix something that maybe they don’t even think is broken? -- Out of the Shadow Dear Out of the Shadow: You’ve been there to celebrate Beth’s wins; now it’s time for your family to do the same. Share your feelings gently, with something like: “I’m excited about this opportunity and hope it doesn’t make things weird between us -- I’d really like for us to support each other, even when our paths overlap.” How your family responds is up to them and out of your control. If they can’t show up for you in this moment, it’s OK to grieve that -- but don’t wait for them to clap before you feel proud. Send your questions for Annie Lane to dearannie@creators.com . COPYRIGHT 2023 CREATORS.COM Annie Lane Annie Lane has offered witty, common-sense solutions to everyday problems in her column, “Dear Annie” since July 2016. She grew up in California and graduated with honors from New York University, where she... more dearannie@creators.com Footer Navigation About Us Our Journalists About OregonLive.com Contact The Newsroom Technical Support Advertise With Us Subscribe to The Oregonian Subscriber Services Digital Subscription FAQ Delivery Opportunities Accessibility Statement Subscriptions The Oregonian eNewspaper Email Newsletters Already a Subscriber Manage your Subscription Place a Vacation Hold Make a Payment Delivery Feedback Read More Top News Today's Top News Politics Crime Business Commuting Weather Education Homes & Gardens Letters to the Editor Video Environment Here is Oregon Noticias en español Special Sections Sports High School Sports Ducks Beavers Trail Blazers Timbers Thorns Recruiting News Entertainment Travel TV & Movies Eat, Drink, Cook Comics Your Regional News Pages Portland Washington County Clackamas County Clark County Pacific Northwest Follow Us Email Newsletters YouTube Twitter Facebook Instagram RSS Mobile iPhone, Android apps Tablet apps More on OregonLive.com Place an Ad Autos Jobs Sponsor Content Post a Job Newspapers.com Archive Your Privacy Choices Privacy Policy | User Agreement | Ad Choices Disclaimer Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement , (updated 8/1/2024) and acknowledgement of our Privacy Policy , and Your Privacy Choices and Rights (u",
    "credibility": 0.6,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.0,
    "quality": 0.565,
    "role": "support",
    "source_grade": "C",
    "tier": "core"
  },
  {
    "id": 7,
    "title": "New ITA Group Research Reveals Emotional Connection Multiplies Customer Loyalty Program Impact by 8x",
    "url": "https://www.businesswire.com/news/home/20251112242622/en/New-ITA-Group-Research-Reveals-Emotional-Connection-Multiplies-Customer-Loyalty-Program-Impact-by-8x",
    "publisher": "businesswire.com",
    "date": "2025-12-02",
    "snippet": "WEST DES MOINES, Iowa--(BUSINESS WIRE)--ITA Group’s new study shows that emotional connection can drive up to eight times more visits and sales from customers. The study, which analyzed loyalty programs from industry leaders including Wells Fargo, T ...",
    "content": "WEST DES MOINES, Iowa--(BUSINESS WIRE)--ITA Group’s new study shows that emotional connection can drive up to eight times more visits and sales from customers. The study, which analyzed loyalty programs from industry leaders including Wells Fargo, T ...",
    "credibility": 0.6,
    "region": "context",
    "domain": "general",
    "source_type": "pr",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.692,
    "role": "support",
    "source_grade": "C",
    "tier": "core"
  },
  {
    "id": 8,
    "title": "Demi Lovato Just Dropped an Amazon Fashion Line & We Want All of It",
    "url": "https://www.eonline.com/news/1424795/demi-lovatos-amazon-fashion-collaboration-is-out-now",
    "publisher": "eonline.com",
    "date": "2025-12-02",
    "snippet": "This sweater can be worn off-the-shoulder for a sexy look, or completely buttoned-up for a warm classic fit. It's made from a textured mid-weight cotton blend, and features a button neckline with an oversized ribbed collar. Plus, the cozy sweater is ...",
    "content": "This sweater can be worn off-the-shoulder for a sexy look, or completely buttoned-up for a warm classic fit. It's made from a textured mid-weight cotton blend, and features a button neckline with an oversized ribbed collar. Plus, the cozy sweater is ...",
    "credibility": 0.6,
    "region": "context",
    "domain": "general",
    "source_type": "analysis",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.692,
    "role": "support",
    "source_grade": "C",
    "tier": "core"
  },
  {
    "id": 9,
    "title": "'I've Asked Pam To Look Into It': Trump Openly Schemes To End Freedom Of Speech, Wants People Who Protest Him To Be 'Put In Jail'",
    "url": "https://www.msn.com/en-us/news/politics/ive-asked-pam-to-look-into-it-trump-openly-schemes-to-end-freedom-of-speech-wants-people-who-protest-him-to-be-put-in-jail/vi-AA1Q05bb?ocid=BingNewsVerp",
    "publisher": "msn.com",
    "date": "2025-12-02",
    "snippet": "Donald Trump signed a memorandum from the Oval Office several weeks ago in September to deploy troops in Memphis. During his remarks, Trump revealed that he asked Pam Bondi to find out if protestors ...",
    "content": "MSN",
    "credibility": 0.6,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "aggregator",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.45,
    "recency": 1.0,
    "us_fit": 0.0,
    "quality": 0.497,
    "role": "support",
    "source_grade": "D",
    "tier": "core"
  }
]