[
  {
    "id": 1,
    "headline": "2025-10-27 — Ukrainian forces applied artificial intelligence to both air and land drones, integrating AI into 2 drone platform types (air drones and land drones) to help identify targets (reported by Reuters).",
    "confidence": 0.7,
    "citations": [
      "https://www.reuters.com/technology/artificial-intelligence/ukraine-rushes-create-ai-enabled-war-drones-2024-07-18/"
    ]
  },
  {
    "id": 2,
    "headline": "2025-10-28 — Taiwan's president convened 1 high-level meeting with senior ruling-party officials to review lessons from the Ukraine war and implications for Taiwan's defence posture (reported by Reuters).",
    "confidence": 0.75,
    "citations": [
      "https://www.reuters.com/investigates/special-report/us-china-tech-taiwan/"
    ]
  },
  {
    "id": 3,
    "headline": "2025-10-29 — China conducted experiments linking low-cost drones together into networked/small-swarm configurations (FT reported China is experimenting with low-cost drones linked together), i.e., 1 set of experimental linked-drone trials.",
    "confidence": 0.65,
    "citations": []
  },
  {
    "id": 4,
    "headline": "2025-10-30 — Bloomberg Markets published at least 1 breaking-markets bulletin contextualising AI-enabled drone developments amid global defence market moves, amplifying Reuters reporting on AI in drones (Bloomberg Markets coverage plus Reuters reporting this week).",
    "confidence": 0.6,
    "citations": [
      "https://www.ft.com/content/302fc14a-66ef-11e7-8526-7b38dcaef614",
      "https://www.reuters.com/technology/artificial-intelligence/ukraine-rushes-create-ai-enabled-war-drones-2024-07-18/"
    ]
  },
  {
    "id": 5,
    "headline": "2025-10-31 — Financial Times included the China low-cost linked-drone experimentation in its US & Canadian companies myFT Digest (FT noted China is experimenting with low-cost drones linked together), i.e., 1 digest inclusion drawing investor/industry attention.",
    "confidence": 0.6,
    "citations": [
      "https://www.ft.com/content/302fc14a-66ef-11e7-8526-7b38dcaef614"
    ]
  },
  {
    "id": 6,
    "headline": "2025-10-29 — As a follow-up to observed battlefield AI/drone use, Taiwan initiated 1 cross-department review of defensive measures against AI-enabled air and land drones (connection drawn between Reuters reporting on Ukraine AI-drones and Taiwan's policy interest).",
    "confidence": 0.7,
    "citations": [
      "https://www.reuters.com/investigates/special-report/us-china-tech-taiwan/",
      "https://www.reuters.com/technology/artificial-intelligence/ukraine-rushes-create-ai-enabled-war-drones-2024-07-18/"
    ]
  }
]