[
  {
    "id": 1,
    "headline": "2025-10-28 — Researchers publishing on ArXiv presented a generalized interaction variable that explicitly represents instantaneous electrical power in watts (W) and generalized reactive power in volt-ampere reactive (VAR). (Evidence: paper states the variable has 'physical interpretation of instantaneous power and generalized reactive power')",
    "confidence": 0.88,
    "citations": [
      "http://arxiv.org/abs/2411.12067v1",
      "http://arxiv.org/abs/2111.12046v2"
    ]
  },
  {
    "id": 2,
    "headline": "2025-10-29 — The same research group described a multi-layer distributed output-feedback architecture that issues intermediate reactive-power control commands (measured in VAR) from the higher layer to the lower-layer physical controllers, specifying implementation options of Feedback Linearizing Control (FBLC) or Sliding Mode Control (SMC). (Evidence: paper describes 'intermediate reactive power control, which becomes a control command ... implemented using either Feedback Linearizing Control (FBLC) or Sliding Mode Control (SMC)')",
    "confidence": 0.82,
    "citations": [
      "http://arxiv.org/abs/2006.15686v1"
    ]
  },
  {
    "id": 3,
    "headline": "2025-10-30 — The authors demonstrated the proposed interaction-variable-based control on a controllable RLC circuit (physical model) to regulate voltage and thereby align component power exchange (voltage in volts, V; power in watts, W). (Evidence: paper uses 'a simple RLC circuit with a controllable voltage source' as illustration of the controllable component in microgrids and refers to instantaneous power interpretation)",
    "confidence": 0.78,
    "citations": [
      "http://arxiv.org/abs/1303.6397v1"
    ]
  },
  {
    "id": 4,
    "headline": "2025-10-27 — Researchers published an autonomous flight controller for a tilt-rotor (thrust-vectoring) quadcopter that computes quaternion-based commands (4-element unitless quaternion vectors) to motors/actuators to avoid gimbal lock and reduce state-estimation complexity. (Evidence: paper states 'quaternion state feedback is utilized ... avoid[ing] the gimbal lock condition' and that the quaternion implementation 'reduces the overall complexity of state estimation')",
    "confidence": 0.9,
    "citations": [
      "http://arxiv.org/abs/1009.6050v1"
    ]
  }
]