[
  {
    "id": 1,
    "title": "Taipei City's Global Pass: A New Partner Channel for Global Startup ...",
    "url": "https://www.prnewswire.com/apac/news-releases/taipei-citys-global-pass-a-new-partner-channel-for-global-startup-spaces-302634237.html",
    "publisher": "prnewswire.com",
    "date": "2025-12-05",
    "snippet": "Taipei City's Global Pass: A New Partner Channel for Global Startup Spaces Accessibility Statement Skip Navigation Resources Data Privacy Contact Us Send a Release News Products Overview Distribution by PR Newswire Guaranteed Paid Placement Cision Media Monitoring Multichannel Am",
    "content": "Taipei City's Global Pass: A New Partner Channel for Global Startup Spaces Accessibility Statement Skip Navigation Resources Data Privacy Contact Us Send a Release News Products Overview Distribution by PR Newswire Guaranteed Paid Placement Cision Media Monitoring Multichannel Amplification All Products Contact General Inquiries Request a Demo Partnerships Media Inquiries Search Search When typing in this field, a list of search results will appear and be automatically updated as you type. Searching for your content... No results found. Please change your search terms and try again. News in Focus Browse News Releases All News Releases All Public Company English-only All Multimedia All Multimedia All Photos All Videos Business & Money Auto & Transportation Aerospace & Defense Air Freight Airlines & Aviation Automotive Maritime & Shipbuilding Railroads & Intermodal Transportation Supply Chain/Logistics Transportation, Trucking & Railroad Travel Trucking & Road Transportation View All Auto & Transportation Business Technology Blockchain Broadcast Tech Computer & Electronics Computer Accessories Computer Hardware Computer Networks Computer Software Data Analytics Electronic Commerce Electronic Components Electronic Design Automation Financial Technology High-Tech Security Internet Technology Nanotechnology Semiconductors View All Business Technology Entertain­ment & Media Advertising Art, Culture & Design Books Entertainment Film & Motion Picture Magazines Music Publishing & Information Services Radio & Podcast Television View All Entertain­ment & Media Financial Services & Investing Accounting News & Issues Acquisitions, Mergers & Takeovers Banking & Financial Services Bankruptcy Bond & Stock Ratings Conference Call Announcements Contracts Cryptocurrency Dividends Earnings Earnings Projections or Forecasts Financing Agreements Insurance Investment Options Joint Ventures Mutual Funds Offerings Private Placement Real Estate Restructuring & Recapitalization Sales Reports Shareholder Activism Shareholder Meetings Venture Capital View All Financial Services & Investing General Business Awards Commercial Real Estate Corporate Expansion Earnings Environmental, Social and Governance (ESG) Human Resource & Workforce Management Licensing/marketing agreements New Products & Services Obituary Outsourcing Businesses Overseas Real Estate (Non-US) Personnel Announcements Residential Real Estate Small-Business Services Socially Responsible Investing Surveys, Polls & Research Trade Show News View All General Business Science & Tech Consumer Technology Artificial Intelligence Blockchain Cloud Computing/Internet of Things Computer Accessories Computer Electronics Computer Hardware Computer Networks Computer Software Consumer Electronics Cryptocurrency Data Analytics Electronic Commerce Electronic Design Automation Financial Technology Mobile Devices/Apps Social Media STEM (Science, Tech, Engineering, Math) Wireless Communications View All Consumer Technology Energy & Natural Resources Alternative Energies Chemical Electrical Utilities General Manufacturing Mining Mining & Metals Natural Gas Utilities Oil & Energy Oil & Gas Discoveries Utilities Water Utilities View All Energy & Natural Resources Environ­ment Conservation & Recycling Environmental Issues Environmental Policy Environmental Products & Services Green Technology Natural Disasters View All Environ­ment Heavy Industry & Manufacturing Aerospace & Defense Agriculture Chemical Computer Accessories Construction & Building General Manufacturing HVAC (Heating, Ventilation & Air-Conditioning) Machinery Machine Tools, Metalworking & Metallurgy Mining Mining & Metals Paper, Forest Products & Containers Precious Metals Textiles Tobacco View All Heavy Industry & Manufacturing Telecomm­unications Computer Accessories Computer Networks Mobile Devices/Apps Telecommunications Telecommunications Carriers & Services Telecommunications Equipment VoIP (Voice over Internet Protocol) Wireless Communications V",
    "credibility": 0.6,
    "observed_at": "2025-12-12T21:27:46Z",
    "region": "context",
    "domain": "ops_ai",
    "source_type": "pr",
    "evidence": {
      "observed_at": "2025-12-12T21:27:46Z",
      "numeric": false,
      "depth": 0.45,
      "sample_size": "",
      "rescued_from": "https://www.tmcnet.com/usubmit/2025/12/05/10301205.htm",
      "rescue_title": "Taipei City's Global Pass: A New Partner Channel for Global Startup Spaces"
    },
    "authority": 0.6,
    "recency": 0.5,
    "us_fit": 0.6333333333333333,
    "quality": 0.567,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 2,
    "title": "Public Media Bridge Fund announces first round of grants to local public media",
    "url": "https://www.msn.com/en-us/news/us/public-media-bridge-fund-announces-first-round-of-grants-to-local-public-media/ar-AA1S2trS?ocid=BingNewsVerp",
    "publisher": "msn.com",
    "date": "unknown",
    "snippet": "MSN",
    "content": "MSN",
    "credibility": 0.6,
    "observed_at": "2025-12-12T21:28:34Z",
    "region": "context",
    "domain": "general",
    "source_type": "aggregator",
    "evidence": {
      "observed_at": "2025-12-12T21:28:34Z",
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.45,
    "recency": 0.8,
    "us_fit": 0.0,
    "quality": 0.448,
    "role": "support",
    "source_grade": "D",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 3,
    "title": "Public Media Bridge Fund announces first round of grants to local public media",
    "url": "https://www.msn.com/en-us/news/us/public-media-bridge-fund-announces-first-round-of-grants-to-local-public-media/ar-AA1S2trS",
    "publisher": "msn.com",
    "date": "2025-12-09",
    "snippet": "MSN",
    "content": "MSN",
    "credibility": 0.6,
    "observed_at": "2025-12-12T21:28:34Z",
    "region": "context",
    "domain": "general",
    "source_type": "aggregator",
    "evidence": {
      "observed_at": "2025-12-12T21:28:34Z",
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.45,
    "recency": 0.7857142857142857,
    "us_fit": 0.0,
    "quality": 0.444,
    "role": "support",
    "source_grade": "D",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 4,
    "title": "Lafayette radio station awarded stabilization grant after elimination of federal funding",
    "url": "https://www.theadvocate.com/acadiana/news/krvs-receives-new-funding/article_e8d78081-b3fd-4caa-92c0-307fcd96eb55.html",
    "publisher": "theadvocate.com",
    "date": "2025-12-09",
    "snippet": "KRVS Lafayette public radio station to receive bridge funds | News | theadvocate.com Skip to main content You are the owner of this article. Edit Article Add New Article Close You have permission to edit this article. Edit Close Baton Rouge New Orleans Acadiana Shreveport Lake Ch",
    "content": "KRVS Lafayette public radio station to receive bridge funds | News | theadvocate.com Skip to main content You are the owner of this article. Edit Article Add New Article Close You have permission to edit this article. Edit Close Baton Rouge New Orleans Acadiana Shreveport Lake Charles Gambit Log in Subscribe Log out Site search Search Home Business News Courts Crime/Police Education Lake Charles Photos State Politics Weather Entertainment/Life 200 for 200 Acadiana's Choice Awards Curious Louisiana Festivals Food Games Louisiana Health Louisiana Inspired Mardi Gras Sports UL Sports High School Sports LSU Sports News Sports Betting Sports Betting Opinion Legals Obits Classifieds Jobs Homes Store E-edition Newsletters Log out Log in Activate Subscribe My account Activate 70° E-edition Newsletters Home Business News Courts Crime/Police Education Lake Charles Photos State Politics Weather Entertainment/Life 200 for 200 Acadiana's Choice Awards Curious Louisiana Festivals Food Games Louisiana Health Louisiana Inspired Mardi Gras Sports UL Sports High School Sports LSU Sports News Sports Betting Sports Betting Opinion Legals Obits Classifieds Jobs Homes Store Lafayette radio station awarded stabilization grant after elimination of federal funding Share this Facebook Twitter WhatsApp SMS Email Print Copy article link Save Close Lafayette radio station awarded stabilization grant after elimination of federal funding BY JOANNA BROWN | Staff writer Joanna Brown Author email Dec 9, 2025 Dec 9, 2025 1 min to read Facebook Twitter WhatsApp SMS Email Amis du Teche performs in Cypress Lake Studios at KRVS Thursday, June 20, 2024, in Lafayette, La. Their live performance is one of several being recorded at the studio as part of an Acadiana music spotlight project organized in partnership with the national radio program World Cafe, which is produced by WXPN in Philadelphia. STAFF PHOTO BY LESLIE WESTBROOK Facebook Twitter WhatsApp SMS Email Print Copy article link Save Lafayette radio station KRVS-FM 88.7 was included in an initial round of grant funding from the Public Media Bridge Fund, designed to support local public media across the country in response to the elimination of federal funds for the Corporation for Public Broadcasting. Grants totaling $26 million will be distributed across 74 organizations operating 186 radio and television stations nationwide. In the initial wave, the fund prioritized support for stations facing the largest financial challenges. KRVS Radio Acadie, housed at the University of Louisiana at Lafayette campus, is one of two Louisiana award recipients. The other is WLAE-TV, out of New Orleans. Cecil Doyle hosts Medicine Ball Caravan as Amis du Teche performs a live set on the show in Cypres Lake Studio at KRVS Thursday, June 20, 2024, in Lafayette, La. Their live performance is one of several being recorded at the studio as part of an Acadiana music spotlight project organized in partnership with the national radio program World Cafe, which is produced by WXPN in Philadelphia. STAFF PHOTO BY LESLIE WESTBROOK The Public Media Bridge Fund was launched by the Public Media Company nonprofit in August, immediately following congressional action that rescinded $1.1 billion in funding and future appropriations for the Corporation for Public Broadcasting. The CPB was created by Congress under the Public Broadcasting Act of 1967, with the majority of its funding going toward financial support for local public media stations. The grants are designed to sustain local news, cultural programming and emergency alerts in the midst of financial uncertainty for local stations, particularly those in rural areas. \"Our goal was to present each grantee with a foothold to stabilize their infrastructure and continue their vital services. Thanks to the rapid and generous response of philanthropic leaders across the U.S., we’ve been able to raise crucial funds and quickly get them into the hands of the stations that need them the most,” sa",
    "credibility": 0.6,
    "observed_at": "2025-12-12T21:28:34Z",
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-12T21:28:34Z",
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 0.7857142857142857,
    "us_fit": 0.6333333333333333,
    "quality": 0.638,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 5,
    "title": "FOX News Media Spotlight Awards recognize team members who went above and beyond in 2025",
    "url": "https://www.msn.com/en-us/entertainment/news/fox-news-media-spotlight-awards-recognize-team-members-who-went-above-and-beyond-in-2025/ar-AA1SaOsb?ocid=BingNewsVerp",
    "publisher": "msn.com",
    "date": "unknown",
    "snippet": "MSN",
    "content": "MSN",
    "credibility": 0.6,
    "observed_at": "2025-12-12T21:28:35Z",
    "region": "context",
    "domain": "general",
    "source_type": "aggregator",
    "evidence": {
      "observed_at": "2025-12-12T21:28:35Z",
      "numeric": true,
      "depth": 0.85,
      "sample_size": ""
    },
    "authority": 0.45,
    "recency": 0.8,
    "us_fit": 0.0,
    "quality": 0.488,
    "role": "support",
    "source_grade": "D",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 6,
    "title": "FOX News Media Spotlight Awards recognize team members who went above and beyond in 2025",
    "url": "https://www.msn.com/en-us/entertainment/news/fox-news-media-spotlight-awards-recognize-team-members-who-went-above-and-beyond-in-2025/ar-AA1SaOsb",
    "publisher": "msn.com",
    "date": "2025-12-11",
    "snippet": "MSN",
    "content": "MSN",
    "credibility": 0.6,
    "observed_at": "2025-12-12T21:28:35Z",
    "region": "context",
    "domain": "general",
    "source_type": "aggregator",
    "evidence": {
      "observed_at": "2025-12-12T21:28:35Z",
      "numeric": true,
      "depth": 0.85,
      "sample_size": ""
    },
    "authority": 0.45,
    "recency": 0.9285714285714286,
    "us_fit": 0.0,
    "quality": 0.52,
    "role": "support",
    "source_grade": "D",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 7,
    "title": "Australia's social media ban for kids under 16 goes into effect",
    "url": "https://abcnews.go.com/GMA/Family/australias-social-media-ban-kids-16-effect/story?id=128243002",
    "publisher": "abcnews.go.com",
    "date": "2025-12-09",
    "snippet": "Australia's social media ban for kids under 16 goes into effect - ABC News ABC News Live Video Shows Shop Interest Successfully Added We'll notify you here with news about Turn on desktop notifications for breaking stories about interest? Off On Stream on Family Australia's socia",
    "content": "Australia's social media ban for kids under 16 goes into effect - ABC News ABC News Live Video Shows Shop Interest Successfully Added We'll notify you here with news about Turn on desktop notifications for breaking stories about interest? Off On Stream on Family Australia's social media ban for kids under 16 goes into effect The national ban is the first of its kind in the world. By Yi-Jin Yu December 9, 2025, 4:14 PM 1:34 A girl poses holding her phone after an interview discussing Australia's social media ban for users under 16, which is scheduled to take effect on December 10, in Sydney, Australia, November 22, 2025. Hollie Adams/Reuters Australia’s social media ban for children 16 and under officially went into effect at midnight local time on Dec. 10. Many child advocates and parents have welcomed the ban, a global first, calling it a move to protect and boost kids' mental health, anxiety levels and self-esteem, even if there is confusion about whether companies can actually keep children off their apps and sites. \"My eldest child is 10. So I think that for parents who have children 10 and younger are really grateful for it because I can absolutely see the benefit of it,\" drama therapist Tanya Short, a mom of three, told ABC News. A girl poses holding her phone after an interview discussing Australia's social media ban for users under 16, which is scheduled to take effect on December 10, in Sydney, Australia, November 22, 2025. Hollie Adams/Reuters Australian Prime Minister Anthony Albanese predicted the new law would become \"a source of national pride\" and said the ban was aimed at protecting and supporting Australian families. Amid what's being called a youth mental health crisis, is social media facing its own 'tobacco moment'? \"This law is about making it easier for you to have a conversation with your child about the risks and harms of engaging online,\" Albanese said in a statement Sunday. \"It’s also about helping parents push back against peer pressure. You don’t have to worry that by stopping your child using ­social media, you’re somehow making them the odd one out. Now, instead of trying to set a 'family rule', you can point to a national ban.\" Social media platforms are required to \"take reasonable steps\" to prevent a child user who is 16 and under from creating or continuing to use a social media account or features that have a social media component to them, according to the law. Companies under the law are required to deactivate or remove current accounts tied to users under 16 and prevent kids from creating new accounts or use workarounds to use the platforms. The ban currently applies to 10 platforms run by social media companies, including Meta’s Facebook, Instagram, and Threads, Reddit, Snapchat, TikTok, Twitch, X and YouTube, according to the eSafety Commissioner, the Australian government’s independent online safety regulator. Social media companies have pushed back against the new law, with Snapchat characterizing the measure as misguided and even potentially risky for children. \"Disconnecting teens from their friends and family doesn’t make them safer — it may push them to less safe, less private messaging apps,\" Snapchat said in a Nov. 22 statement . \"We continue to advocate for more privacy-conscious solutions, such as mandating age verification at the device, operating system, or app store level.\" Meta, the parent company of Facebook, Instagram and Threads, also spoke out against the countrywide ban. \"Experts, youth groups, and many parents agree that blanket bans are not the solution—they isolate teens from online communities and information, while providing inconsistent protection across the many apps they use,\" a Meta spokesperson said in part in a statement to ABC News Tuesday. \"There's a better way: legislation that empowers parents to approve app downloads and verify age that allows families—not the government—to decide which apps teens can access.\" Popular Reads Britain's MI5 suppressed trut",
    "credibility": 0.6,
    "observed_at": "2025-12-12T21:28:35Z",
    "region": "context",
    "domain": "cultural_events",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-12T21:28:35Z",
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 0.7857142857142857,
    "us_fit": 0.6333333333333333,
    "quality": 0.638,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 8,
    "title": "Why Hyper-Local Planning Agency Novus Media Likes Buying CTV Programmatically",
    "url": "https://www.adexchanger.com/ctv-roundup/why-hyper-local-planning-agency-novus-media-likes-buying-ctv-programmatically/",
    "publisher": "adexchanger.com",
    "date": "2025-12-05",
    "snippet": "Why Hyper-Local Planning Agency Novus Media Likes Buying CTV Programmatically | AdExchanger image/svg+xml : Topics Latest Marketers Agencies Publishers Technology Platforms Identity Measurement Data Privacy Artificial Intelligence CTV Commerce AdExplainer Exclusive Report Daily N",
    "content": "Why Hyper-Local Planning Agency Novus Media Likes Buying CTV Programmatically | AdExchanger image/svg+xml : Topics Latest Marketers Agencies Publishers Technology Platforms Identity Measurement Data Privacy Artificial Intelligence CTV Commerce AdExplainer Exclusive Report Daily News Roundup Opinion All Columns Data-Driven Thinking On TV & Video The Sell Sider Content Studio Comic Contributor Guidelines About Us Advertise Newsletter AdExchanger Advisory Board About Us Contact Us Events Programmatic I/O New York AdExchanger Awards Webinars All Events Network Events Podcasts AdExchanger Talks The Big Story Inside the Stack Programmatic I/O New York Become an AdHero Subscribe Sign In Sign In Topics Latest Marketers Agencies Publishers Technology Platforms Identity Measurement Data Privacy Artificial Intelligence CTV Commerce AdExplainer Exclusive Report Daily News Roundup Opinion All Columns Data-Driven Thinking On TV & Video The Sell Sider Content Studio Comic Contributor Guidelines Events & Awards Programmatic I/O New York AdExchanger Awards Webinars All Events Network Events Podcasts AdExchanger Talks The Big Story Inside the Stack Subscribe Free Sign Up About Us Advertise Newsletter AdExchanger Advisory Board About Us Contact Us CONNECT Home CTV Roundup Why Hyper-Local Planning Agency Novus Media Likes Buying CTV Programmatically CTV Roundup Why Hyper-Local Planning Agency Novus Media Likes Buying CTV Programmatically By Victoria McNally Friday, December 5th, 2025 – 1:00 am SHARE: An interview with Paul DeJarnatt VP, Managing Director Is it too soon to start thinking about New Year’s resolutions? Since taking on AdExchanger’s CTV beat at the beginning of March, I’ve learned a lot about the industry from the perspectives of publishers , measurement companies , platforms and even a few brands . So next year, to round out my education, I’m setting a goal for myself to start talking to more media planners, agency executives and buy-side experts. But why wait until 2026? I’m already on the hunt for more agency leaders to talk to – like Paul DeJarnatt, the head of digital at Novus Media, whom I spoke to last month. Novus is a bit unusual compared to other independently run agencies, as it specializes in ZIP code-level media buying at scale. In fact, the “new challenge” of a geography-focused lens is what initially drew DeJarnatt over from his previous role at Publicis in 2022, he told me. Novus also stands out from other independent agencies by working with a lot of big, non-region-specific companies that you wouldn’t expect to be thinking in terms of hyper-locality, like B2B cloud software services and national health care providers, said DeJarnatt. After all, for every customer base that exists, there’s got to be a place that contains the highest population density of that customer base. Or, as DeJarnatt put it, “Birds of a feather flock together. And the reason people flock together isn’t always obvious, but there’s always a through line.” Here are some more highlights from the conversation we had: AdExchanger: What are the most common questions or concerns you’re hearing from clients about their CTV strategies? Subscribe AdExchanger Daily Get our editors’ roundup delivered to your inbox every weekday. Daily Roundup Daily News Roundup Disco Is So Back; Bippity Boppity Slop! PAUL DEJARNATT: A lot of clients want the pricing advantage and flexibility of CTV, but they also want the ability to buy specific programming. As it exists today, those are still two separate things, and so we have to continue that education and understand the advantages and disadvantages of both. We do try to talk to our clients about having a diverse viewpoint, strategically, in the way they go to market with video. There are times that call for specific programming or specific direct deals to get access to inventory measurement, or audience segments that might be kind of locked behind a partnership deal. What we find, though, is that most of our clients ap",
    "credibility": 0.6,
    "observed_at": "2025-12-12T21:28:35Z",
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-12T21:28:35Z",
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 0.5,
    "us_fit": 0.6333333333333333,
    "quality": 0.567,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  },
  {
    "id": 9,
    "title": "The Champions Of Channel: It’s B&T’s Best Of The Best Media Planners!",
    "url": "https://www.bandt.com.au/the-champions-of-channel-its-bts-best-of-the-best-media-planners/",
    "publisher": "bandt.com.au",
    "date": "2025-12-10",
    "snippet": "The Champions Of Channel: It's B&T's Best Of The Best Media Planners! - B&T Advertising Campaigns Marketing Media Technology Regulars Agency Scorecards Best of the Best Campaigns of the Month CMO Power List CMOs to Watch Culture Bites Fast 10 New Business Winners Spotlight on Spo",
    "content": "The Champions Of Channel: It's B&T's Best Of The Best Media Planners! - B&T Advertising Campaigns Marketing Media Technology Regulars Agency Scorecards Best of the Best Campaigns of the Month CMO Power List CMOs to Watch Culture Bites Fast 10 New Business Winners Spotlight on Sponsors Jobs Awards 30 Under 30 B&T Awards Cairns Crocodiles Women In Media Women Leading Tech Search Trending topics: Nine Seven Cairns Crocodiles Channel 10 ABC B&T Awards NRL Are Media Initiative OMD TikTok Women in Media Awards Meta The Block Omnicom social media ban Thinkerbell TV Ratings Radio Ratings Sports Marketing About Contact Editorial Guidelines Privacy Terms Advertise © 2025 B&T. The Misfits Media Company Pty Ltd. Reading: The Champions Of Channel: It’s B&T’s Best Of The Best Media Planners! Share Subscribe Subscribe Search Advertising Campaigns Marketing Media Technology Regulars Agency Scorecards Best of the Best Campaigns of the Month CMO Power List CMOs to Watch Culture Bites Fast 10 New Business Winners Spotlight on Sponsors Jobs Awards 30 Under 30 B&T Awards Cairns Crocodiles Women In Media Women Leading Tech Follow US About Contact Editorial Guidelines Privacy Terms Advertise © 2025 B&T. The Misfits Media Company Pty Ltd. B&T > Agencies > Best of the Best > The Champions Of Channel: It’s B&T’s Best Of The Best Media Planners! Agencies Best of the Best Featured The Champions Of Channel: It’s B&T’s Best Of The Best Media Planners! Published on: 10th December 2025 at 11:59 AM Arvind Hickman Share 13 Min Read SHARE Charged with helping brands reach the right audiences on the right channels at the right time, media planners are the lifeblood of media agencies and play a critically important role in an increasingly fragmented and complex media environment. Whether it’s trying to sweat efficiencies on plan, or finding effectiveness in channels that had been previously overlooked, planners are the vital cogs that can make all of the difference as agencies often battle to do more with stagnant, or sometimes shrinking media budgets. Australia is a market blessed with some of the finest planners in the world and coming up with a list of 10 is an unenviable task. Nonetheless, B&T has given it a crack. This year’s list focused on talent with senior media planning job titles, and the editorial team considered nominations received (see below), market research about candidates, the industry profile of frontrunners and their achievements in the past 12 months. There are some fantastic planners that have just missed the cut this year that warrant a call out. They include Wavemaker’s Ryan Haeusler (who appeared on last year’s list ), Havas’ Jessica Loi, UM’s Michael Mellington and Hearts & Science’s Jaime Mills-Blayney. It’s also worth taking a look at B&T’s Best of the Best Strategy list . Remember to cast your nominations for our final two Best of the Best lists, Business Support Executive and Spin Doctors, below. Here are the B&T’s Best of the Best Media Planners for 2025: 10. Hannah Fisher, client partner and head of SA Government, Carat Fisher is a media strategist, planner, buyer and team leader with 15 years’ industry experience, including 10 years at Carat. She started her career writing TV and radio scripts and now leads the South Australian Government portfolio, working across behaviour-change, tourism, education and public service campaigns. She’s recently been the leading media planning, buying and strategy on campaigns for Inklings SA, SA Police, Tour Down Under, Tasting Australia and more. Government media planning is a fine art and Fisher’s efforts have been acknowledged by being named Carat’s MVP in its most recent B&T Agency Scorecard . Known for her collaborative style, process-driven and calm leadership, Fisher is passionate about building high-performing teams and delivering work that makes a genuine difference to the community. 9. Ryan Hancock, national strategy & planning director, Match & Wood Hancock is not only one of the risin",
    "credibility": 0.6,
    "observed_at": "2025-12-12T21:28:36Z",
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "observed_at": "2025-12-12T21:28:36Z",
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 0.8571428571428572,
    "us_fit": 0.6333333333333333,
    "quality": 0.656,
    "role": "support",
    "source_grade": "C",
    "tier": "core",
    "access_issue_type": "ok",
    "body_text_present": true
  }
]