[
  {
    "id": 1,
    "title": "Winning The $500 Holiday: How To Grow When Shoppers Spend Less",
    "url": "https://www.forbes.com/councils/forbesbusinesscouncil/2025/11/18/winning-the-500-holiday-how-to-grow-when-shoppers-spend-less/",
    "publisher": "forbes.com",
    "date": "2025-11-24",
    "snippet": "Appealing to conscious consumers and capturing a share of the $500 holiday will require a strategic approach that mixes value, convenience and the right messaging.",
    "content": "Winning The $500 Holiday: How To Grow When Shoppers Spend Less Newsletters Games Share a News Tip Featured Featured Breaking News White House Watch Daily Cover Stories America's 2025 Top Wealth Management Teams Private Wealth List | Paid Program The Forbes CIO Next List: 2025 | Paid Program America's 2025 Top Wealth Management Teams High Net Worth List When Teens Fundraise To End Blood Cancer, They Change Lives, Including Their Own | Paid Program The Employee Well-Being Imperative | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Visa Infinite Asia Pacific: Getting Away, Their Own Way | Paid Program Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Next Billion-Dollar Startups 2025 Four Reasons To Rethink Your Savings Strategy America's Most Powerful Women In Sports Navigating Retirement In Today’s Economic Landscape Get Your Data AI-Ready | Paid Program Streamline, Secure, Innovate: Inside Three Organizations That Rewired Their Networks For What’s Next | Paid Program CxO Spotlight: Innovation in Healthcare Forbes Iconoclast: How Top Investors Find Opportunities In Times Of Uncertainty Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All Employee and Customer Experience The New Brand Growth Formula: A Data-Driven Culture Fueled By AI | Paid Program Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Dell Technologies BrandVoice | Paid Program Money Money See All ETF Investing Trends Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitchen & Dining Outdoor Pets Storage & Organization Tools Wine & Bar Fashion Accessories Clothing Eyewear Footwear Jewelry Handbags & Purses Lingerie & Sleepwear Outdoor & Fitness Apparel Outerwear Watches Kids & Baby Gear Baby Gear Kids Clothes & Accessories Nu",
    "credibility": 0.65,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": true,
      "depth": 0.85,
      "sample_size": ""
    },
    "authority": 0.65,
    "recency": 1.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.754,
    "role": "support",
    "source_grade": "C"
  },
  {
    "id": 2,
    "title": "How BNPL And Cash-Back Apps Influence Holiday Spending Behavior",
    "url": "https://www.forbes.com/sites/shelleykohan/2025/11/21/how-buy-now-pay-later-and-cash-back-apps-drive-holiday-shopping/",
    "publisher": "forbes.com",
    "date": "2025-11-24",
    "snippet": "This holiday season buy now, pay later and pure cash-back apps will aid consumers in budgeting their shopping lists.",
    "content": "How BNPL And Cash-Back Apps Influence Holiday Spending Behavior Newsletters Games Share a News Tip Featured Featured Breaking News White House Watch Daily Cover Stories America's 2025 Top Wealth Management Teams Private Wealth List | Paid Program The Forbes CIO Next List: 2025 | Paid Program America's 2025 Top Wealth Management Teams High Net Worth List When Teens Fundraise To End Blood Cancer, They Change Lives, Including Their Own | Paid Program The Employee Well-Being Imperative | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Visa Infinite Asia Pacific: Getting Away, Their Own Way | Paid Program Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Next Billion-Dollar Startups 2025 Four Reasons To Rethink Your Savings Strategy America's Most Powerful Women In Sports Navigating Retirement In Today’s Economic Landscape Get Your Data AI-Ready | Paid Program Streamline, Secure, Innovate: Inside Three Organizations That Rewired Their Networks For What’s Next | Paid Program CxO Spotlight: Innovation in Healthcare Forbes Iconoclast: How Top Investors Find Opportunities In Times Of Uncertainty Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All Employee and Customer Experience The New Brand Growth Formula: A Data-Driven Culture Fueled By AI | Paid Program Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Dell Technologies BrandVoice | Paid Program Money Money See All ETF Investing Trends Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitchen & Dining Outdoor Pets Storage & Organization Tools Wine & Bar Fashion Accessories Clothing Eyewear Footwear Jewelry Handbags & Purses Lingerie & Sleepwear Outdoor & Fitness Apparel Outerwear Watches Kids & Baby Gear Baby Gear Kids Clothes & Accessories N",
    "credibility": 0.65,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": true,
      "depth": 0.85,
      "sample_size": ""
    },
    "authority": 0.65,
    "recency": 1.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.754,
    "role": "support",
    "source_grade": "C"
  },
  {
    "id": 3,
    "title": "Value tops shoppers’ wish lists this holiday season in new survey",
    "url": "https://www.marketingdive.com/news/value-tops-shoppers-wish-lists-this-holiday-season-in-new-survey/805744/",
    "publisher": "marketingdive.com",
    "date": "2025-11-24",
    "snippet": "Gen Z is the most likely to shop in physical stores this season, at a rate of 91%, according to new data from Mastercard.",
    "content": "Value tops shoppers’ wish lists this holiday season in new survey | Marketing Dive Skip to main content CONTINUE TO SITE ➞ Don't miss tomorrow's marketing industry news Let Marketing Dive's free newsletter keep you informed, straight from your inbox. Daily Dive M-F Mobile Weekly Every Thursday Agencies Weekly Every Monday By signing up to receive our newsletter, you agree to our Terms of Use and Privacy Policy . You can unsubscribe at anytime. Deep Dive Library Events Press Releases Topics Subscribe Search Subscribe Search Brand Strategy Mobile Creative Social Media Video Agencies Data/Analytics Influencer Marketing Ad Tech CMO Corner An article from Dive Brief Value tops shoppers’ wish lists this holiday season in new survey Gen Z is the most likely to shop in physical stores this season, at a rate of 91%, according to new data from Mastercard. Published Nov. 19, 2025 Sara Karlovitch Staff Reporter post share post print email license The top emotions consumers are feeling when it comes to holiday shopping are excitement, at 45%, and connection, at 28%. Getty Images Listen to the article 3 min This audio is auto-generated. Please let us know if you have feedback . Dive Brief: Value for money is the most important factor for consumers when it comes to holiday purchases, followed by product quality and discounts, according to data from Mastercard’s Shopper Snapshot shared with Marketing Dive. With the focus placed squarely on value, sales and discounts have become a driving force when it comes to consumer purchases. Among survey respondents, 73% routinely purchase a wish list item once it goes on sale, 71% respond to personalized discount codes and 63% act when limited-time sales are ending. Consumers are using artificial intelligence as a digital helping hand this holiday season. Approximately half of Gen Z and millennials would let AI handle gift buying if it meant avoiding holiday stress. Additionally, 42% of consumers are already using the technology to assist with buying gifts Dive Insight: With consumers starting their holiday shopping earlier and earlier, marketers have been focused on timing campaigns to capture buyer attention. Brands have taken a variety of approaches. For example, Home Depot tugged at heartstrings with ads showcasing Christmas tree farmers while Walmart tapped into seasonal nostalgia with ads featuring the Grinch. However, data from Mastercard found above all else, consumers are looking for value this holiday season. Mastercard’s “Shopper Snapshot 2025: Holiday Shopping Insights” report is based on responses from 4,007 consumers from the U.S., Canada, the U.K and the UAE. It was conducted in partnership with The Harris Poll. Consumers are looking to cash in on rewards this season, with 79% of respondents planning on using loyalty points and rewards to complete purchases. The hunt for value could provide a way to collect first party data, with 66% of respondents saying they regularly provide their contact information in order to receive a discount during the holidays, per the report. Social commerce is becoming a more trusted outlet for consumers, with 57% of Gen Z and 61% of millennials saying their trust in the channel has increased. Additionally, 53% of Gen Z consumers and 47% of millennials report trusting the opinion of influencers over their own friends. While online and social shopping is growing in popularity, consumers are still flocking to physical stores, with 90% of consumers most often frequenting physical stores for holiday shopping. Gen Z is actually the most likely to shop physical stores, at a rate of 91%. Physical stores offer Gen Z consumers with inspiration, with 81% reporting getting gift ideas from displays. E-commerce sites are the second most used source for holiday shopping for 82% of consumers. This jumps to 87% when looking at Gen Z and 86% when looking at millennials. Approximately two-thirds of Gen Z and millennial consumers plan to increase or maintain their purchasing of ",
    "credibility": 0.6,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": true,
      "depth": 0.85,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.732,
    "role": "support",
    "source_grade": "C"
  },
  {
    "id": 4,
    "title": "A Tale of Two Pop-Ups: Amazon, Primark Aim to Capture NYC Holiday Magic",
    "url": "https://www.retailtouchpoints.com/topics/retail-store-design/experiential-retail/a-tale-of-two-pop-ups-amazon-primark-aim-to-capture-nyc-holiday-magic",
    "publisher": "retailtouchpoints.com",
    "date": "2025-11-24",
    "snippet": "Two takes on the holiday pop-up, from Amazon and Primark, present an interesting study of the model’s variability and utility.",
    "content": "A Tale of Two Pop-Ups: Amazon, Primark Aim to Capture NYC Holiday Magic - Retail TouchPoints Emerald Media Network Advertise Linkedin X-twitter Facebook Instagram Youtube Advertisement Latest Resources View All Resources Research Reports iPapers Webinars Events Digital Event Digital Event Tradeshow Digital Event Digital Event Podcast ThinkTank Hub Latest Resources View All Resources Research Reports iPapers Webinars Events Podcast ThinkTank Hub About Us Advertise With Us Blog Awards TouchPoints TV Privacy Policy Subscribe Trending Target Joins the ChatGPT Bandwagon Just in Time for Black Friday UrbanStems, Quince Partner with Drinks for Online Alcohol Sales Why Authenticity, Expertise and Passion, Not Follower Totals, Drive Influencer Marketing Listen Now: What DoorDash Plans to Deliver Next A Tale of Two Pop-Ups: Amazon, Primark Aim to Capture NYC Holiday Magic Is Retail Ready for a World Where Crypto is just Another Way to Pay? Search Search A Tale of Two Pop-Ups: Amazon, Primark Aim to Capture NYC Holiday Magic November 18, 2025 at 11:09 AM EST By Nicole Silberstein Inside Amazon's Home for the Holidays pop-up in NYC. (Retail TouchPoints) The holiday season is replete with holly, garland, sales…and pop-ups, especially in high-traffic tourist destinations like New York City. This year, two takes on the holiday pop-up, from Amazon and Primark , present an interesting study of the model’s variability and utility. The two companies took markedly different approaches to their pop-up experiences, although neither activation supported on-site sales. Online-only Amazon highlighted its Holiday Shop offerings in a richly decorated, three -story, three -day pop-up adjacent to tourist hotspot Bryant Park., Primark has opened a small “Studio” space in the NYU-dominated NoHo neighborhood that will remain open through the holidays and beyond, aimed at building buzz for the Spring 2026 opening of its Herald Square flagship . Two very different companies (not least because one dominates U.S. ecommerce and the other has no ecommerce at all) with two very different goals, and yet they both turned to non-transactional pop-ups to achieve their aims. Here’s how these varying expressions of the pop-up model played out. Amazon Brings its Holiday Shop to Life The “home theater” room in Amazon’s Home for the Holidays pop-up. (Retail TouchPoints) Amazon’s first-ever “Home for the Holidays Social Content Studio” was staged from Nov 10-14 at GH on the Park , an event space that at one point in time, long ago, was a stately home overlooking Bryant Park. For the event, Amazon transformed the three stories of the space back into a home, albeit with a modern bent. Advertisement Fully decorated themed rooms included a kitchen and walk-in pantry, dining room, “boudoir” lounge area, playroom, theater, home office and gym. Each area was stuffed to the brim with products from Amazon’s Holiday Shop , with QR codes placed throughout to “shop” the products on display. Image: Retail TouchPoints However, the goal of the event wasn’t sales. Rather, it was a chance for Amazon to break out from the expansive yet restrictive walls of the internet. The pop-up goal was to bring Amazon’s online assortment to life for media and influencers, all busily preparing their holiday hot lists and seasonal shopping recommendations. The idea was to create an immersive experience (which it certainly was) that not only allowed for product trials but also created opportunities for content creation and “photo moments.” Amazon also took the opportunity to highlight its climate-friendly product offerings with a dedicated sustainability section that featured products from its Climate Pledge Friendly program and Amazon Resale , including a curated Climate Pledge Fashion Edit available on Amazon-owned Shopbop . Primark Builds Buzz for Herald Square Store Image: Retail TouchPoints Downtown, Primark hosted its own very different pop-up, the Primark Studio, at 55 Great Jones Street in NoHo. The ",
    "credibility": 0.78,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.78,
    "recency": 1.0,
    "us_fit": 0.0,
    "quality": 0.646,
    "role": "support",
    "source_grade": "B"
  },
  {
    "id": 5,
    "title": "How Walmart is deploying the Grinch to boost holiday marketing",
    "url": "https://www.retaildive.com/news/walmart-grinch-whoknewville-holiday-marketing-campaign/805729/",
    "publisher": "retaildive.com",
    "date": "2025-11-24",
    "snippet": "The Dr. Seuss icon, played by Walton Goggins, appears in new ads and a Times Square takeover showcasing deals on products like the Switch 2.",
    "content": "How Walmart is deploying the Grinch to boost holiday marketing | Retail Dive Skip to main content CONTINUE TO SITE ➞ Don't miss tomorrow's retail industry news Let Retail Dive's free newsletter keep you informed, straight from your inbox. Daily Dive M-F DTC Weekly Every Tuesday Marketing Weekly Every Wednesday Tech Weekly Every Thursday Operations Weekly Every Monday By signing up to receive our newsletter, you agree to our Terms of Use and Privacy Policy . You can unsubscribe at anytime. Deep Dive Podcasts Library Events Press Releases Topics Sign up Search Sign up Search Operations Marketing Technology DTC Distressed Retail Department Stores Executives Financial News Trends E-Commerce Holidays An article from How Walmart is deploying the Grinch to boost holiday marketing Times Square takeovers, disruptive NFL integrations and long-form ads factor into the next phase of the retailer’s Dr. Seuss-themed campaign. Published Nov. 18, 2025 Peter Adams Senior Reporter post share post print email license Actor Walton Goggins (right) appears as the Grinch alongside Mindy Lou Who in new Dr. Seuss-inspired holiday ads from Walmart. Permission granted by Walmart First published on Listen to the article 5 min This audio is auto-generated. Please let us know if you have feedback . Walmart’s Dr. Seuss-themed holiday marketing is getting a boost from the Grinch as the effort enters its second phase ahead of Black Friday, per details shared with sister publication Marketing Dive. The big-box store previously teased appearances from the infamous green grump, and on Monday announced Walton Goggins will be filling his shoes for the “WhoKnewVille” campaign. Goggins, who makes his on-screen debut as the Grinch in a new social video , previously led spots launching Walmart’s larger “Who Knew?” platform focused on changing perceptions of the retailer. Putting Goggins in a starring seasonal role not only builds on the existing equity of “Who Knew?,” but also responds to social media chatter among fans who view the “White Lotus” actor — known for portraying mischievous characters — as an ideal fit for the part. “WhoKnewVille” extends Walmart’s strategy of orienting more of its holiday advertising around pop culture touchstones to drive relevance while highlighting services like its mobile app and membership program Walmart+. “The notion of nostalgia obviously helps us appeal to the customer in a more emotional way, but it also allows us to do a lot of the strategy and business-driving components of the work that we need to do,” said David Hartman, vice president of creative at Walmart. Hartman added that recognizable figures like the Grinch “help [Walmart] open the door of attention for our customers” during a crowded period for retail marketing. Goggin’s snarky take on the Grinch takes the reins in a long-form ad that is running as a YouTube masthead and will appear in shorter cutdowns. In the brand film, “WhoKnewVille” protagonist Mindy Lou Who scales Mt. Crumpit in search of a partner who can raise awareness for Walmart’s Black Friday deals. The Grinch takes some convincing, but the pair, accompanied by dog sidekick Max, eventually descend on the titular town of WhoKnewVille to covertly leave gifts under Christmas trees, courtesy of Walmart. Mishaps occur along the way, with the Grinch getting caught by a kid who mistakes him for Santa Claus and stepping on a Lego piece. Stephanie Beatriz, another actor from the first batch of “Who Knew?” ads, is also slotted to make an appearance as the mayor of WhoKnewVille, according to Hartman. The celebrity studded creative follows previous “WhoKnewVille” ads that have gained traction with consumers, including an introductory spot that has accrued more than 9 million YouTube views as of press time. “We’ve found through our campaigns over time that long-form content actually performs really well for Walmart,” said Hartman. Building a unified brand world Along with the narrative-driven videos, the Grinch will s",
    "credibility": 0.8,
    "region": "context",
    "domain": "ops_ai",
    "source_type": "analysis",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.8,
    "recency": 1.0,
    "us_fit": 0.6333333333333333,
    "quality": 0.782,
    "role": "support",
    "source_grade": "B"
  },
  {
    "id": 6,
    "title": "Kimpton Surfcomber Hotel Debuts Whoville-Inspired Holiday Pop-Up, \"How The Social Club Stole Christmas\"",
    "url": "https://finance.yahoo.com/news/kimpton-surfcomber-hotel-debuts-whoville-140000543.html",
    "publisher": "finance.yahoo.com",
    "date": "2025-11-24",
    "snippet": "Kimpton Surfcomber Hotel, a boutique property in the heart of South Beach's Art Deco District, is welcoming the holidays with a new immersive installation at its signature restaurant, The Social Club.",
    "content": "Kimpton Surfcomber Hotel, a boutique property in the heart of South Beach's Art Deco District, is welcoming the holidays with a new immersive installation at its signature restaurant, The Social Club.",
    "credibility": 0.6,
    "region": "context",
    "domain": "cultural_events",
    "source_type": "analysis",
    "evidence": {
      "numeric": false,
      "depth": 0.45,
      "sample_size": ""
    },
    "authority": 0.6,
    "recency": 1.0,
    "us_fit": 0.0,
    "quality": 0.565,
    "role": "support",
    "source_grade": "D"
  }
]