[
  {
    "category": "Cultural",
    "name": "Shop Becomes Creator Studio",
    "description": "A Hyde Park streetwear shop retooled its retail footprint into Stockboy Studios, running creator residencies, workshops and paid content production from the storefront. The transition shows small independent shops can monetize attention as content and community, not only transactions. ",
    "operator_move": "Operator move: Independent brand owner (Stockboy) — 0-8 weeks — KPI: run 4 creator-led studio days, record 8 short-form assets, and measure +20% weekend foot traffic and conversion lift from content-driven promos.",
    "strength": 0.84,
    "US_fit": 1.0,
    "operationality": 0.9,
    "support": [
      1
    ],
    "on_spine": true,
    "quant_support": "light",
    "source_grade": "B",
    "citations": [
      1
    ],
    "id": "S1"
  },
  {
    "category": "Market",
    "name": "Vacant Space As Content Canvas",
    "description": "Zero Empty Spaces is converting vacant retail real estate into artist-run popups across 33 locations, turning dead rent into ephemeral stages for content-driven activations. Landlords are treating space as programmable media rather than static leasable square footage.",
    "operator_move": "Operator move: Landlord or mall operator (Zero Empty Spaces partner) — 0-8 weeks — KPI: deploy 1 short-term artist activation in an underperforming bay, measure earned media mentions and a 15% uplift in adjacent store visits.",
    "strength": 0.86,
    "US_fit": 1.0,
    "operationality": 0.85,
    "support": [
      2
    ],
    "on_spine": true,
    "quant_support": "strong",
    "source_grade": "B",
    "citations": [
      2
    ],
    "id": "S2"
  },
  {
    "category": "Market",
    "name": "Brand Pop-Up As Content Engine",
    "description": "Activewear label Splits59 debuted a curated NYC pop-up designed for events and content capture, using the space to pilot product, community programming, and social-first commerce funnels. The store was built with event cadence and content production in mind rather than purely transactions.",
    "operator_move": "Operator move: Brand retail lead (Splits59) — 0-8 weeks — KPI: schedule 6 ticketed micro-events, produce 12 short videos from each event, and track direct-attributed online orders from event creatives.",
    "strength": 0.82,
    "US_fit": 0.95,
    "operationality": 0.85,
    "support": [
      3
    ],
    "on_spine": true,
    "quant_support": "light",
    "source_grade": "A",
    "citations": [
      3
    ],
    "id": "S3"
  },
  {
    "category": "Market",
    "name": "Landlords Shift To Experiential Curators",
    "description": "Retail property managers are redeploying asset strategy from pure leasing to integrated experiential programming, connecting brands, creators and tech to increase dwell and capture attention. Property owners now see programming budgets as yield management tools.",
    "operator_move": "Operator move: Property manager (regional portfolio) — 0-8 weeks — KPI: pilot 1 cross-brand experiential weekend, measure dwell time +25% and incremental concessionaire sales.",
    "strength": 0.8,
    "US_fit": 1.0,
    "operationality": 0.8,
    "support": [
      4
    ],
    "on_spine": true,
    "quant_support": "light",
    "source_grade": "B",
    "citations": [
      4
    ],
    "id": "S4"
  },
  {
    "category": "Cultural",
    "name": "Studio-Branded In-Store Takeovers",
    "description": "A24 partnered with Barnes & Noble to open branded shop-in-shops that sell books, merch and curated media experiences, treating bookstores as extensions of the studio brand and content funnel. This shows legacy retail can host vertical-branded studios as recurring content platforms.",
    "operator_move": "Operator move: Brand partnership lead (A24 / retailer) — 0-8 weeks — KPI: launch 1 branded shop-in-shop, schedule 4 artist/film events, and track member sign-ups and merch attach rate.",
    "strength": 0.88,
    "US_fit": 1.0,
    "operationality": 0.9,
    "support": [
      5
    ],
    "on_spine": true,
    "quant_support": "light",
    "source_grade": "B",
    "citations": [
      5
    ],
    "id": "S5"
  },
  {
    "category": "Technology",
    "name": "Agentic Commerce Enables Pricing Precision",
    "description": "Agentic commerce frameworks push retailers to unify product, customer and transaction data to enable automated, intent-driven commerce decisions at the store level. That data layer enables dynamic offers and discounts tied to content behaviors rather than blunt markdowns.",
    "operator_move": "Operator move: Head of commerce (omnichannel brand) — 0-8 weeks — KPI: run a first-party data audit and deploy 1 dynamic, content-linked offer in-store, measuring percent of sales via targeted offers versus broad markdowns.",
    "strength": 0.79,
    "US_fit": 0.9,
    "operationality": 0.78,
    "support": [
      7
    ],
    "on_spine": true,
    "quant_support": "light",
    "source_grade": "A",
    "citations": [
      7
    ],
    "id": "S6"
  }
]